{
    "version": "https://jsonfeed.org/version/1",
    "title": "Perrera.com",
    "home_page_url": "https://perrera.com/",
    "feed_url": "https://perrera.com/feed.json",
    "description": "An online publication about design and related ideas written by Amy Parker and Dan Perrera.",
    "icon": "https://perrera.com/apple-touch-icon.png",
    "favicon": "https://perrera.com/favicon.ico",
    "expired": false,
    "items": [
    
        {
            "id": "https://perrera.com/2018/2018-recap/",
            "title": "2018 Recap",
            "summary": null,
            "content_text": "2018 was truly a roller coaster of a year. What started out as one of the slowest quarters in Fore Design history quickly turned into an all-out sprint for the rest of the year.Fore DesignAt the end of Q1, Dan made a new friend through Soloish, a Slack channel for freelancers and (very) small businesses. Aforementioned friend was looking for some friendly designers to partner with on a few projects so, after branding his own company, he connected us with a handful of clients in the start-up space. Working together was such a great experience that he approached us to get his own product off the ground.We have both wanted to work on a single project for a longer period of time than our typical consulting projects allows for so we enthusiastically leapt at the opportunity to launch and grow a product.QualaIn July, we stopped taking on new clients through Fore Design and joined Quala as Head of Design (Amy) and Head of Experience (Dan). We’ve been working to carefully craft an exciting new data intelligence platform starting with the customer-facing app. If you’re interested in learning more about what we’re working on, drop us a line and we’ll keep you updated.LondonThis fall, we took our first legitimate vacation in recent memory, timing our trip to coincide with the London Design Festival and Design Biennale.Festival events were scattered throughout the city so we frequently ran into sculptures, installations, performances, and pop-ups, like this neon lion in Trafalgar Square.At Somerset House, host of the Biennale, pavilions from different countries as well as installations by a few individual artists interpreted the theme of “Emotional States.” Our hands-down favorite piece was Es Devlin’s giant egg-shaped relief of the city overlaid with warped home videos that expertly interacted with the map.    Your browser does not support the video tag.Aside from eating pizza for a solid third of the trip, another major highlight was the Poster Girls exhibit at the Transport Museum, a massive collection of works designed by female employees and contractors of Transport for London since 1920.Home RenoSince we were no longer working so collaboratively on client projects — Dan’s now handing front-end engineering and product management, I’m focused on design and user experience — our tiny shared office would no longer cut it. We love working at home so we knew we didn’t want to explore office space or co-working situations so we had to figure out a way to make our space work for our new needs.The solution turned out to be dividing up our living area to make room for a desk for Dan while Amy kept the entire office for herself. This forced us to reconsider the other choices we’d made in our space and realized we should apply as much design consideration to our living space (especially since we spend 100% of our time there) as we do to our work. While we’ve still got a bit more work ahead of us, we’re significantly enjoying both our living and working space much more now that they really work how we need them to.Since this year marked a major shift in our work life, we wanted to thank all of our friends, colleagues, and clients who’ve supported us over the last four years.",
            "content_html": "<p>2018 was truly a roller coaster of a year. What started out as one of the slowest quarters in Fore Design history quickly turned into an all-out sprint for the rest of the year.</p><h2 id=\"fore-design\">Fore Design</h2><p>At the end of Q1, Dan made a new friend through Soloish, a Slack channel for freelancers and (very) small businesses. Aforementioned friend was looking for some friendly designers to partner with on a few projects so, after <a href=\"http://www.escvelocity.io\">branding his own company</a>, he connected us with a handful of clients in the start-up space. Working together was such a great experience that he approached us to get his own product off the ground.</p><p>We have both wanted to work on a single project for a longer period of time than our typical consulting projects allows for so we enthusiastically leapt at the opportunity to launch and grow a product.</p><h2 id=\"quala\">Quala</h2><p>In July, we stopped taking on new clients through Fore Design and joined Quala as Head of Design (Amy) and Head of Experience (Dan). We’ve been working to carefully craft an exciting new data intelligence platform starting with the customer-facing app. If you’re interested in learning more about what we’re working on, drop us a line and we’ll keep you updated.</p><h2 id=\"london\">London</h2><p>This fall, we took our first legitimate vacation in recent memory, timing our trip to coincide with the London Design Festival and Design Biennale.</p><p>Festival events were scattered throughout the city so we frequently ran into sculptures, installations, performances, and pop-ups, like this neon lion in Trafalgar Square.</p><p><img src=\"/assets/2018-recap/orange-lion.jpg\" alt=\"Neon Orange Lion\" /></p><p>At Somerset House, host of the Biennale, pavilions from different countries as well as installations by a few individual artists interpreted the theme of “Emotional States.” Our hands-down favorite piece was Es Devlin’s giant egg-shaped relief of the city overlaid with warped home videos that expertly interacted with the map.</p><video class=\"w-100 pv2\" controls=\"\">  <source src=\"/assets/2018-recap/esdevlin.mp4\" type=\"video/mp4\" />  Your browser does not support the video tag.</video><p>Aside from eating pizza for a solid third of the trip, another major highlight was the Poster Girls exhibit at the Transport Museum, a massive collection of works designed by female employees and contractors of Transport for London since 1920.</p><p><img src=\"/assets/2018-recap/poster-girls.jpg\" alt=\"Neon Orange Lion\" /></p><h2 id=\"home-reno\">Home Reno</h2><p>Since we were no longer working so collaboratively on client projects — Dan’s now handing front-end engineering and product management, I’m focused on design and user experience — our tiny shared office would no longer cut it. We love working at home so we knew we didn’t want to explore office space or co-working situations so we had to figure out a way to make our space work for our new needs.</p><p>The solution turned out to be dividing up our living area to make room for a desk for Dan while Amy kept the entire office for herself. This forced us to reconsider the other choices we’d made in our space and realized we should apply as much design consideration to our living space (especially since we spend 100% of our time there) as we do to our work. While we’ve still got a bit more work ahead of us, we’re significantly enjoying both our living and working space much more now that they really work how we need them to.</p><p>Since this year marked a major shift in our work life, we wanted to thank all of our friends, colleagues, and clients who’ve supported us over the last four years.</p>",
            "url": "https://perrera.com/2018/2018-recap/",
            
            
            
            
            
            "date_published": "2018-12-31T00:00:00+00:00",
            "date_modified": "2018-12-31T00:00:00+00:00",
            "author": {
                "name": "Amy Parker and Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2018/four-years-of-fore-design/",
            "title": "Four Years of Fore Design",
            "summary": null,
            "content_text": "As Fore Design approaches its fourth anniversary, we’ve decided to close down the consultancy.We’re very proud of the work we’ve done and are grateful for the opportunities we’ve had to work with some wonderful clients.It’s been a long-standing ambition of ours however, to launch a design-led product in which strategy, branding, experience, and technology come together to create something truly great. So when one of our clients asked us both to come on board to lead design and experience for his latest venture, we were thrilled. We’ve been incredibly excited to be able to focus on the areas we’re most interested: Dan in experience and engineering, Amy in information design and branding.We feel like leading design and experience in-house for a product is the best way to develop the design culture a business needs in order to build something truly great. Because design is really about interrogating the problem and we’ve never truly had the opportunity to apply everything we’ve learned about that to one, longer-term project.We’ll continue to write (semi-infrequently) here, though now that our nights and weekends won’t be filled with side projects and marketing plans, maybe we’ll find time to write more.We couldn’t be more excited for this next chapter of our careers and we hope you’ll continue to follow along on our journey.",
            "content_html": "<p>As Fore Design approaches its fourth anniversary, we’ve decided to close down the consultancy.</p><p>We’re very proud of the work we’ve done and are grateful for the opportunities we’ve had to work with some wonderful clients.</p><p>It’s been a long-standing ambition of ours however, to launch a design-led product in which strategy, branding, experience, and technology come together to create something truly great. So when one of our clients asked us both to come on board to lead design and experience for his latest venture, we were thrilled. We’ve been incredibly excited to be able to focus on the areas we’re most interested: Dan in experience and engineering, Amy in information design and branding.</p><p>We feel like leading design and experience in-house for a product is the best way to develop the design culture a business needs in order to build something truly great. Because design is really about interrogating the problem and we’ve never truly had the opportunity to apply everything we’ve learned about that to one, longer-term project.</p><p>We’ll continue to write (semi-infrequently) here, though now that our nights and weekends won’t be filled with side projects and marketing plans, maybe we’ll find time to write more.</p><p>We couldn’t be more excited for this next chapter of our careers and we hope you’ll continue to follow along on our journey.</p>",
            "url": "https://perrera.com/2018/four-years-of-fore-design/",
            
            
            
            
            
            "date_published": "2018-12-31T00:00:00+00:00",
            "date_modified": "2018-12-31T00:00:00+00:00",
            "author": {
                "name": "Amy Parker and Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2018/scratching-our-own-list/",
            "title": "Scratching our Own List",
            "summary": null,
            "content_text": "About two years ago, Amy and I made some fundamental changes to how we eat, the result of which was cooking for ourselves more — a lot more. While cooking and baking have turned into a real joy for us, the ceremony of meal planning, list making, and trips to the grocery store always remained a chore.Meal planning involved digging out recipes from various books and the internet then transcribing the ingredients for each recipe into a shared list in iOS Reminders. After that arduous task, we’d be off to the store to shop, which wouldn’t be so bad if our list stayed in sync but it never did.Surely there’s an app for that, right?It turns out that there are tons of “grocery shopping apps” but all of them seem to approach the problem the way a computer might and not necessarily the way a human might. As the saying goes, if you want something done right, do it yourself — and that&#8217;s just what we did.Introducing OmnomWe decided to apply our design and development process to our problem. The result is Omnom, an app designed to improve the grocery shopping experience. It does everything that you might expect from a grocery shopping list with a few notable improvements.A Sensible WorkflowOmnom keeps track of your favorite recipes, allowing you to customize them to your preference. Choose items from your recipes to create a meal plan, then add ingredients for all those items to your shopping list with the press of a button. Omnom eliminates the time-intensive task of transcribing over and over.ContextNow you’re at the store and you see “3 tomatoes” on the list. Okay, what type of tomatoes do you need? Beefsteak? Roma? Heirloom? We found ourselves asking the question, “What is this for?” again and again. Omnom keeps that data together, giving you all the information you need at a glance.Fast, Reliable SyncingFor us, grocery shopping is a team sport so rock-solid syncing was a top priority. This has been a revelation for me personally. I’ve gone from uninformed cart-pusher to autonomous shopper, cutting down the time that we’re in the store.Be a Beta TesterAmy and I have been using Omnom for the last few weeks and have already saved so much time. We think that this could be a useful tool for other home cooking enthusiasts and, while it’s not quite ready for a public release, we are looking for a few good beta testers.If you’d like to help us out, head over to omnom.xyz, review the features in more detail, and sign up to be a beta tester at the bottom of the page.",
            "content_html": "<p>About two years ago, Amy and I made some fundamental changes to how we eat, the result of which was cooking for ourselves more — a lot more. While cooking and baking have turned into a real joy for us, the ceremony of meal planning, list making, and trips to the grocery store always remained a chore.</p><p>Meal planning involved digging out recipes from various books and the internet then transcribing the ingredients for each recipe into a shared list in iOS Reminders. After that arduous task, we’d be off to the store to shop, which wouldn’t be so bad if our list stayed in sync but it never did.</p><p>Surely there’s an app for that, right?</p><p>It turns out that there are tons of “grocery shopping apps” but all of them seem to approach the problem the way a computer might and not necessarily the way a human might. As the saying goes, if you want something done right, do it yourself — and that&#8217;s just what we did.</p><h2 id=\"introducing-omnom\">Introducing Omnom</h2><p>We decided to apply our design and development process to our problem. The result is Omnom, an app designed to improve the grocery shopping experience. It does everything that you might expect from a grocery shopping list with a few notable improvements.</p><p><img src=\"/assets/scratching-our-own-list/omnom-logo.jpg\" alt=\"Omnom Logo\" /></p><h3 id=\"a-sensible-workflow\">A Sensible Workflow</h3><p>Omnom keeps track of your favorite recipes, allowing you to customize them to your preference. Choose items from your recipes to create a meal plan, then add ingredients for all those items to your shopping list with the press of a button. Omnom eliminates the time-intensive task of transcribing over and over.</p><p><img src=\"/assets/scratching-our-own-list/omnom-mobile-x2.jpg\" alt=\"Omnom Screens\" /></p><h3 id=\"context\">Context</h3><p>Now you’re at the store and you see “3 tomatoes” on the list. Okay, what type of tomatoes do you need? Beefsteak? Roma? Heirloom? We found ourselves asking the question, “What is this for?” again and again. Omnom keeps that data together, giving you all the information you need at a glance.</p><p><img src=\"/assets/scratching-our-own-list/omnom-list.jpg\" alt=\"Omnom Screens\" /></p><h3 id=\"fast-reliable-syncing\">Fast, Reliable Syncing</h3><p>For us, grocery shopping is a team sport so rock-solid syncing was a top priority. This has been a revelation for me personally. I’ve gone from uninformed cart-pusher to autonomous shopper, cutting down the time that we’re in the store.</p><h2 id=\"be-a-beta-tester\">Be a Beta Tester</h2><p>Amy and I have been using Omnom for the last few weeks and have already saved so much time. We think that this could be a useful tool for other home cooking enthusiasts and, while it’s not quite ready for a public release, we are looking for a few good beta testers.</p><p>If you’d like to help us out, head over to <a href=\"https://omnom.xyz\">omnom.xyz</a>, review the features in more detail, and sign up to be a beta tester at the bottom of the page.</p>",
            "url": "https://perrera.com/2018/scratching-our-own-list/",
            
            
            
            
            
            "date_published": "2018-03-06T00:00:00+00:00",
            "date_modified": "2018-03-06T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2018/designing-the-kcfa-website/",
            "title": "Designing the KCFA Website",
            "summary": null,
            "content_text": "We’re constantly evolving our process at Fore Design. In order to do that, it’s really important that we examine each part of it after every project so we can determine what works and what can be improved.One phase that worked particularly well for us while working on a new website for Kate Chertavian Fine Art was visual design. Here’s a brief look at how it went, from kickoff meeting to launch.DiscoveryAfter spending a morning at Kate’s office furiously taking notes and munching on homemade scones, we heard a few key things that would inform both the strategy and the visual design of the site.The main thing she and her team of art consultants wanted prospective clients to understand is that their job isn’t always glamorous but that they’re seasoned pros who’ll do whatever it takes to get the job done. They also wanted the site to help them attain a more even balance of private and public clients.We also learned that, due to the nature of her client base, we wouldn’t have access to any photography for the private side of the business. Further, with major restrictions on displaying artwork for marketing or editorial purposes, we wouldn’t be able to reproduce any art unless it was shown in context or unrecognizable. For a visual art consultancy, this would be tricky!Look and FeelAs part of our design process, we put together moodboards to get a sense of how color palettes, graphic elements, type treatments, and imagery will work together to convey a specific look and feel. As I wrote in “Exploring Design Directions,” they’re a great way to get everyone excited about and invested in the outcome of the project and ensure we don’t run into any surprises later on.Our goal is to come up with directions that are as different from each other as possible while still making sense for the brand. We want to explore the poles of each concept so that when we review, we can pull out the elements from each board that make the most sense.Based on our findings from the Discovery meeting, we came up with three distinct concepts to explore: depth of knowledge, privacy, and transparency.To convey the concept of depth of knowledge, we put together a board filled with overlapping, layered elements, a mix of display, serif, and sans serif typefaces, and photos of art hanging in well-loved living spaces. This had the wonderful secondary effect of feeling a little untidy.  Moodboard number two focused on the discrete nature of Kate’s business. Subtle, understated elements and moody but simple photos of art in context reflect a quiet confidence.  Transparency and approachability were the key themes of moodboard three. A palette of medium-toned neutrals plus behind-the-scenes imagery reveal the legwork — and messiness — that’s involved in the process. Extreme closeups of paintings, drawings, and sculptures help us get around display restrictions and lend interesting color and texture to the design.  Board three was the overwhelming winner. We brightened the color palette a bit and incorporated some of the overlapping elements from board one but kept the photography strategy and type treatments in place.Visual DesignAs we learned in Discovery, there’s a strong dichotomy between Kate’s private and public work — in fact, they have almost nothing to do with one another — and neither could appear more prevalent than the other. I knew right away I wanted to explore the idea of a split or a strong contrast. We also needed to incorporate a tag line or description on the home page so something as minimal as a full-screen, 50/50 split (my original vision) wouldn’t cut it.I looked around at a few art and museum websites and whenever something with similar content structure caught my eye, I drew it as exactly as I could in my sketchbook. When a sketch sparked an idea, I iterated on it in as many different ways as I could think of until I had a layout that (a) worked well for my content and (b) was very different from my original inspiration.  I was initially into the idea of a stark black (private) vs. white (public) contrast but, based on our moodboard discussions, I knew that would be too harsh. The idea that went into production was a split between text on the left and two detail images on the right linking to the private and public sections of the site.              Home page  We then carried that layout idea through to the institutional landing page before diverging the layout to fit the needs of the content deeper in the site.              Institutional (public) landing page                Private landing page  We didn’t end up incorporating any overlapping elements since the imagery itself conveyed the “messiness” we were looking for. Instead, we opted for a more structured but flexible grid that we could reuse across the site for multiple types of content.The result was a look that Kate felt authentically represented her practice and helped deliver an outward-facing identity that perfectly matched her experience and expertise.For more details on the full project, check out the case study or visit the site.",
            "content_html": "<p>We’re constantly evolving our process at Fore Design. In order to do that, it’s really important that we examine each part of it after every project so we can determine what works and what can be improved.</p><p>One phase that worked particularly well for us while working on a <a href=\"https://katecfineart.com\">new website for Kate Chertavian Fine Art</a> was visual design. Here’s a brief look at how it went, from kickoff meeting to launch.</p><h2 id=\"discovery\">Discovery</h2><p>After spending a morning at Kate’s office furiously taking notes and munching on homemade scones, we heard a few key things that would inform both the strategy and the visual design of the site.</p><p>The main thing she and her team of art consultants wanted prospective clients to understand is that their job isn’t always glamorous but that they’re seasoned pros who’ll do whatever it takes to get the job done. They also wanted the site to help them attain a more even balance of private and public clients.</p><p>We also learned that, due to the nature of her client base, we wouldn’t have access to any photography for the private side of the business. Further, with major restrictions on displaying artwork for marketing or editorial purposes, we wouldn’t be able to reproduce any art unless it was shown in context or unrecognizable. For a visual art consultancy, this would be tricky!</p><h2 id=\"look-and-feel\">Look and Feel</h2><p>As part of our design process, we put together moodboards to get a sense of how color palettes, graphic elements, type treatments, and imagery will work together to convey a specific look and feel. As I wrote in <a href=\"/2017/exploring-design-directions/\">“Exploring Design Directions,”</a> they’re a great way to get everyone excited about and invested in the outcome of the project and ensure we don’t run into any surprises later on.</p><p>Our goal is to come up with directions that are as different from each other as possible while still making sense for the brand. We want to explore the poles of each concept so that when we review, we can pull out the elements from each board that make the most sense.</p><p>Based on our findings from the Discovery meeting, we came up with three distinct concepts to explore: depth of knowledge, privacy, and transparency.</p><p>To convey the concept of depth of knowledge, we put together a board filled with overlapping, layered elements, a mix of display, serif, and sans serif typefaces, and photos of art hanging in well-loved living spaces. This had the wonderful secondary effect of feeling a little untidy.</p><div class=\"ba b--light-gray mb3\">  <img src=\"/assets/designing-the-kcfa-website/KCFA-Moodboard1.jpg\" alt=\"Moodboard 1\" class=\"db\" /></div><p>Moodboard number two focused on the discrete nature of Kate’s business. Subtle, understated elements and moody but simple photos of art in context reflect a quiet confidence.</p><div class=\"ba b--light-gray mb3\">  <img src=\"/assets/designing-the-kcfa-website/KCFA-Moodboard2.jpg\" alt=\"Moodboard 2\" class=\"db\" /></div><p>Transparency and approachability were the key themes of moodboard three. A palette of medium-toned neutrals plus behind-the-scenes imagery reveal the legwork — and messiness — that’s involved in the process. Extreme closeups of paintings, drawings, and sculptures help us get around display restrictions and lend interesting color and texture to the design.</p><div class=\"ba b--light-gray mb3\">  <img src=\"/assets/designing-the-kcfa-website/KCFA-Moodboard3.jpg\" alt=\"Moodboard 3\" class=\"db\" /></div><p>Board three was the overwhelming winner. We brightened the color palette a bit and incorporated some of the overlapping elements from board one but kept the photography strategy and type treatments in place.</p><h2 id=\"visual-design\">Visual Design</h2><p>As we learned in Discovery, there’s a strong dichotomy between Kate’s private and public work — in fact, they have almost nothing to do with one another — and neither could appear more prevalent than the other. I knew right away I wanted to explore the idea of a split or a strong contrast. We also needed to incorporate a tag line or description on the home page so something as minimal as a full-screen, 50/50 split (my original vision) wouldn’t cut it.</p><p>I looked around at a few art and museum websites and whenever something with similar content structure caught my eye, I drew it as exactly as I could in my sketchbook. When a sketch sparked an idea, I iterated on it in as many different ways as I could think of until I had a layout that (a) worked well for my content and (b) was very different from my original inspiration.</p><div class=\"ba b--light-gray mb3\">  <img src=\"/assets/designing-the-kcfa-website/sketchbook.jpg\" alt=\"Process Sketch\" class=\"db\" /></div><p>I was initially into the idea of a stark black (private) vs. white (public) contrast but, based on our moodboard discussions, I knew that would be too harsh. The idea that went into production was a split between text on the left and two detail images on the right linking to the private and public sections of the site.</p><figure>  <div class=\"ba b--light-gray mb3\">    <img src=\"/assets/designing-the-kcfa-website/home-iPadProSmall-h.jpg\" alt=\"Home page design\" class=\"db\" />  </div>  <figcaption>    Home page  </figcaption></figure><p>We then carried that layout idea through to the institutional landing page before diverging the layout to fit the needs of the content deeper in the site.</p><figure>  <div class=\"ba b--light-gray mb3\">    <img src=\"/assets/designing-the-kcfa-website/public-iPad-ProSmall-h.jpg\" alt=\"Institutional Landing Page\" class=\"db\" />  </div>  <figcaption>    Institutional (public) landing page  </figcaption></figure><figure>  <div class=\"ba b--light-gray mb3\">    <img src=\"/assets/designing-the-kcfa-website/private-iPad-ProSmall-h.jpg\" alt=\"Private Landing Page\" class=\"db\" />  </div>  <figcaption>    Private landing page  </figcaption></figure><p>We didn’t end up incorporating any overlapping elements since the imagery itself conveyed the “messiness” we were looking for. Instead, we opted for a more structured but flexible grid that we could reuse across the site for multiple types of content.</p><p>The result was a look that Kate felt authentically represented her practice and helped deliver an outward-facing identity that perfectly matched her experience and expertise.</p><p>For more details on the full project, check out the <a href=\"https://foredesign.co/projects/kate-chertavian-fine-art\">case study</a> or <a href=\"https://www.katecfineart.com\">visit the site</a>.</p>",
            "url": "https://perrera.com/2018/designing-the-kcfa-website/",
            
            
            
            
            
            "date_published": "2018-01-07T00:00:00+00:00",
            "date_modified": "2018-01-07T00:00:00+00:00",
            "author": {
                "name": "Amy Parker"
            }
        },
    
        {
            "id": "https://perrera.com/2017/2017-Recap/",
            "title": "2017 Recap",
            "summary": null,
            "content_text": "2017 was all about challenging ourselves. While our consulting work at Fore Design hummed along, Amy and I took on some new creative challenges.Writing and SpeakingStarting with a redesign of this site in June, I made a concerted effort to write more about design and explore related ideas. Amy joined the effort in August and looking back, I’m excited by the content we’ve produced.We also contributed to Net Magazine a handful of times. Amy participated in a “Design Challenge” and curated a gallery of exciting new web design while I answered some “Big Questions” about web typography, design trends, and my favorite design tool.In October, Amy spoke for the first time at Dribbble’s inaugural Hang Time conference on a panel called Unlocking Creativity. Not only did she enrich the audience at the conference, she documented her answers to the panel questions so every one could benefit.TeachingStarting at the beginning of the year, I had the opportunity to teach a class on interactive design at my alma mater, Boston University. It has been such a delight to teach aspiring designers not only how to code but how to use code as a design tool, a subject that I’ve been increasingly passionate about.In two semesters, I’ve been truly impressed with how students have been able to pick up web technology and produce compelling designs in a relatively short time. While I hope that I’m making an impact for each of my students, it has been an even greater benefit for me. It has allowed me to revisit my core assumptions about designing for the screen and forced me to clarify my thinking. It’s also made me strengthen my fundamentals in HTML, CSS, and JavaScript, particularly my vocabulary, which is key when helping beginners get up and running.DesigningIn 2017, we were lucky to work with clients new and old. We also continued our popular Red Sox Scores data visualization project and voiced our political views with a month-long, free, downloadable poster project called Print &amp; Protest.We were also happy to have our design work for Perrera.com, Fore Design, Shubox, and KCFA featured in various inspiration galleries around the web. The notable improvement in our work can clearly be traced back to Amy taking it upon herself to master HTML and CSS. She has written the lion’s share of the front-end code for all of our projects this year which has allowed me to explore interesting interactions and new frameworks, as well as carve out time to play with new technology. While it evolves with every project, it has been exciting to witness the results of our new process come to fruition.It was so great to tackle new challenges, put our ideas out into the world, and get such positive feedback from our clients, colleagues, and the design community. We’re looking forward to announcing a new Fore Design project in 2018. Stay tuned!",
            "content_html": "<p>2017 was all about challenging ourselves. While our consulting work at <a href=\"https://foredesign.co\">Fore Design</a> hummed along, Amy and I took on some new creative challenges.</p><h2 id=\"writing-and-speaking\">Writing and Speaking</h2><p>Starting with a <a href=\"/2017/redesign-2017/\">redesign of this site</a> in June, I made a concerted effort to write more about design and explore related ideas. <a href=\"/2017/better-together/\">Amy joined the effort</a> in August and looking back, I’m excited by the content we’ve produced.</p><p>We also contributed to <a href=\"http://www.creativebloq.com/net-magazine\">Net Magazine</a> a handful of times. Amy participated in a “<a href=\"http://cabaret.netlify.com\">Design Challenge</a>” and curated a gallery of exciting new web design while I answered some “Big Questions” about web typography, design trends, and my favorite design tool.</p><p>In October, Amy spoke for the first time at Dribbble’s inaugural <a href=\"/2017/hang-time-2017/\">Hang Time conference</a> on a panel called Unlocking Creativity. Not only did she enrich the audience at the conference, she <a href=\"/2017/unlocking-creativity/\">documented her answers</a> to the panel questions so every one could benefit.</p><h2 id=\"teaching\">Teaching</h2><p>Starting at the beginning of the year, I had the opportunity to teach a class on interactive design at my alma mater, Boston University. It has been such a delight to teach aspiring designers not only how to code but how to use code as a design tool, a subject that I’ve been increasingly passionate about.</p><p>In two semesters, I’ve been truly impressed with how students have been able to pick up web technology and produce compelling designs in a relatively short time. While I hope that I’m making an impact for each of my students, it has been an even greater benefit for me. It has allowed me to revisit my core assumptions about designing for the screen and forced me to clarify my thinking. It’s also made me strengthen my fundamentals in HTML, CSS, and JavaScript, particularly my vocabulary, which is key when helping beginners get up and running.</p><h2 id=\"designing\">Designing</h2><p>In 2017, we were lucky to work with clients new and old. We also continued our popular <a href=\"https://foredesign.co/soxscores\">Red Sox Scores</a> data visualization project and voiced our political views with a month-long, free, downloadable poster project called <a href=\"https://dribbble.com/foredesign/projects/473359-Print-Protest\">Print &amp; Protest</a>.</p><p>We were also happy to have our design work for Perrera.com, Fore Design, <a href=\"https://shubox.io\">Shubox</a>, and <a href=\"https://www.katecfineart.com\">KCFA</a> featured in various inspiration galleries around the web. The notable improvement in our work can clearly be traced back to Amy taking it upon herself to master HTML and CSS. She has written the lion’s share of the front-end code for all of our projects this year which has allowed me to explore interesting interactions and new frameworks, as well as carve out time to play with new technology. While it evolves with every project, it has been exciting to witness the results of our new process come to fruition.</p><p>It was so great to tackle new challenges, put our ideas out into the world, and get such positive feedback from our clients, colleagues, and the design community. We’re looking forward to announcing a new Fore Design project in 2018. Stay tuned!</p>",
            "url": "https://perrera.com/2017/2017-Recap/",
            
            
            
            
            
            "date_published": "2017-12-31T00:00:00+00:00",
            "date_modified": "2017-12-31T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2017/red-sox-scores-2017/",
            "title": "Red Sox Scores 2017",
            "summary": null,
            "content_text": "The Boston Red Sox season came to a close in the middle of October, as did the second year of our popular Red Sox Scores project. The undertaking explores the intersection of two of our favorite, but seemingly disparate, things: design and baseball.The 2016 project was bound by just two constraints: each score had to be posted before the start of the next game, and the final score had to be visually represented in the design. While this led to some interesting work and some themes did emerge over the course of the season, the body of work felt disjointed.While being creatively unbound was an excellent place to start from, we wondered what would happen if we added more constraints for our second season so, this year, in addition to the time and content parameters from 2016, home games had to be on a white background, away games on black, and the Red Sox always had to be red. We also created a complementary palette of colors for opposing teams, making sure no two sets of colors would ever end up back-to-back.I’m particularly proud of how we evolved the project this year. The result is a stronger, more interesting, and more cohesive body of work. Like last year, we collected the complete season in a 6x9-inch, softcover, perfect-bound book, indexed by date, game number, and opponent, with a special score cheat sheet. In addition to the book, we’re offering 18” x 24” posters of select visualizations. If you enjoyed the project, purchasing one of our products is the best way to support it.We’re so pleased that we’ve found something that we can share with the world every day during baseball season. The reaction and support we’ve received from the design community, friends, and family has kept us motivated to keep the project going. Red Sox Scores will be back for 2018 with even more interesting updates.",
            "content_html": "<p>The Boston Red Sox season came to a close in the middle of October, as did the second year of our popular <a href=\"https://dribbble.com/foredesign/projects/497477-Red-Sox-Scores-2017\">Red Sox Scores project</a>. The undertaking explores the intersection of two of our favorite, but seemingly disparate, things: design and baseball.</p><p>The 2016 project was bound by just two constraints: each score had to be posted before the start of the next game, and the final score had to be visually represented in the design. While this led to some interesting work and some themes did emerge over the course of the season, the body of work felt disjointed.</p><p>While being creatively unbound was an excellent place to start from, we wondered what would happen if we added <em>more</em> constraints for our second season so, this year, in addition to the time and content parameters from 2016, home games had to be on a white background, away games on black, and the Red Sox always had to be red. We also created a complementary palette of colors for opposing teams, making sure no two sets of colors would ever end up back-to-back.</p><p><img src=\"/assets/red-sox-scores-2017/schedule.gif\" alt=\"Sox Scores Cover\" /></p><p>I’m particularly proud of how we evolved the project this year. The result is a stronger, more interesting, and more cohesive body of work. Like last year, we collected the complete season in a 6x9-inch, softcover, <a href=\"https://foredesign.co/soxscores/2017-book\">perfect-bound book</a>, indexed by date, game number, and opponent, with a special score cheat sheet. In addition to the book, we’re offering <a href=\"https://foredesign.co/soxscores\">18” x 24” posters</a> of select visualizations. If you enjoyed the project, purchasing one of our products is the best way to support it.</p><p><img src=\"/assets/red-sox-scores-2017/book.jpg\" alt=\"Red Sox Scores 2017: The Book\" /></p><p>We’re so pleased that we’ve found something that we can share with the world every day during baseball season. The reaction and support we’ve received from the design community, friends, and family has kept us motivated to keep the project going. Red Sox Scores will be back for 2018 with even more interesting updates.</p>",
            "url": "https://perrera.com/2017/red-sox-scores-2017/",
            
            
            
            
            
            "date_published": "2017-12-04T00:00:00+00:00",
            "date_modified": "2017-12-04T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2017/reconsidering-digital-space/",
            "title": "Reconsidering Digital Space",
            "summary": null,
            "content_text": "What if Fore Design was a department store?That’s the question I asked myself when I started designing the latest version of our website. Approaching it this way helped me consider everything from how big the type should be to where I’d place the signage and how people would move around the space.I’m not alone in this way of thinking: Pentagram partner Paula Scher uses the same technique. In How to Think Like a Great Graphic Designer, Scher tells author Debbie Millman she’s “designing a building as a user’s manual. I’m taking a form of print and marrying it to a three-dimensional system.”I’ve done the opposite, taking a three-dimensional space and marrying it to a website, but I found it very freeing to think outside the typical constructs of what we think a website should be. Here’s a brief summary of my approach:CustomersWe have a few main groups of people who come to our site: potential clients vetting us, our work, and our services, peers interested in our work or our writing, and customers buying one of our products.In my head, I translated those groups to customers entering our fictional department store. They’re either coming into the space for the first time or they’re returning and are more familiar with the space. Either group might be looking to browse, or might be interested in tracking down something specific. So how do I get these very different groups to where they’re going (even if that’s nowhere in particular)?SignageI’d place a big store directory at the front of the store and another at the elevator exit so our customer could focus completely on where they need to go as soon as they’re at a decision point. As they move around the space, they’d probably need an identifier to know what department they’re in and signage to know where the other departments are.To translate that to our website, our “store directory” is our home page menu. With diverse groups of people trying to get to different places, we felt it was important to help them self serve — present them with the options and let them decide where they want or need to go. Sometimes getting out of the way is best experience you can give your customer.  “Department identifiers” are a combination of the section titles at the top of the page (the department our customer is currently in) and the sidebar menu (departments they can see from where they are and might like to go).  StylingMapping the Fore Design brand onto a physical space would probably look pristine and modern, with glossy white floors and furniture, matte white walls, minimal black fixtures, and simple but bold black lettering on all the signage to let the product shine through. In digital form, that translates to white backgrounds with a single typeface set in black and lots of negative space to let our projects stand out.In a physical space, there’s a clear content hierarchy: some signs are meant to be viewed up close and provide an overview while others are place markers meant to be seen from a distance. This helped me establish a typographic hierarchy and decide when to make wayfinding content front and center (like the menu) and when it should “be seen from a distance” (like the sidebar menu or section titles).Moving AroundI thought the idea of taking an elevator up and down in our theoretical department store was a sensical analogue for moving customers around our site. Dan added subtle upward transitions between sections and pages to help visitors understand where they are in the context of the site.Turns out, a real-life, three-dimensional space is a great way to think about making a website. Translating depth and dimension to a flat plane unlocked a lot of possibilities for designing our digital space.If you’ve ever approached a project as though it’s a totally different medium, I’d be excited to hear what you learned.",
            "content_html": "<p>What if Fore Design was a department store?</p><p>That’s the question I asked myself when I started designing <a href=\"https://foredesign.co\">the latest version of our website</a>. Approaching it this way helped me consider everything from how big the type should be to where I’d place the signage and how people would move around the space.</p><p>I’m not alone in this way of thinking: Pentagram partner Paula Scher uses the same technique. In <em>How to Think Like a Great Graphic Designer</em>, Scher tells author Debbie Millman she’s “designing a building as a user’s manual. I’m taking a form of print and marrying it to a three-dimensional system.”</p><p>I’ve done the opposite, taking a three-dimensional space and marrying it to a website, but I found it very freeing to think outside the typical constructs of what we think a website should be. Here’s a brief summary of my approach:</p><h2 id=\"customers\">Customers</h2><p>We have a few main groups of people who come to our site: potential clients vetting us, <a href=\"https://foredesign.co/projects\">our work</a>, and our services, peers interested in our work or <a href=\"https://foredesign.co/journal\">our writing</a>, and customers buying one of <a href=\"https://foredesign.co/soxscores\">our products</a>.</p><p>In my head, I translated those groups to customers entering our fictional department store. They’re either coming into the space for the first time or they’re returning and are more familiar with the space. Either group might be looking to browse, or might be interested in tracking down something specific. So how do I get these very different groups to where they’re going (even if that’s nowhere in particular)?</p><h2 id=\"signage\">Signage</h2><p>I’d place a big store directory at the front of the store and another at the elevator exit so our customer could focus completely on where they need to go as soon as they’re at a decision point. As they move around the space, they’d probably need an identifier to know what department they’re in and signage to know where the other departments are.</p><p>To translate that to our website, our “store directory” is our home page menu. With diverse groups of people trying to get to different places, we felt it was important to help them self serve — present them with the options and let them decide where they want or need to go. Sometimes getting out of the way is best experience you can give your customer.</p><div class=\"ba b--light-gray mb3\">  <img src=\"/assets/reconsidering-digital-space/fore-home.png\" alt=\"Home Page\" class=\"db\" /></div><p>“Department identifiers” are a combination of the section titles at the top of the page (the department our customer is currently in) and the sidebar menu (departments they can see from where they are and might like to go).</p><div class=\"ba b--light-gray mb3\">  <img src=\"/assets/reconsidering-digital-space/fore-projects.png\" alt=\"Projects Page\" class=\"db\" /></div><h2 id=\"styling\">Styling</h2><p>Mapping the Fore Design brand onto a physical space would probably look pristine and modern, with glossy white floors and furniture, matte white walls, minimal black fixtures, and simple but bold black lettering on all the signage to let the product shine through. In digital form, that translates to white backgrounds with a single typeface set in black and lots of negative space to let our projects stand out.</p><p>In a physical space, there’s a clear content hierarchy: some signs are meant to be viewed up close and provide an overview while others are place markers meant to be seen from a distance. This helped me establish a typographic hierarchy and decide when to make wayfinding content front and center (like the menu) and when it should “be seen from a distance” (like the sidebar menu or section titles).</p><h2 id=\"moving-around\">Moving Around</h2><p>I thought the idea of taking an elevator up and down in our theoretical department store was a sensical analogue for moving customers around our site. Dan added subtle upward transitions between sections and pages to help visitors understand where they are in the context of the site.</p><p>Turns out, a real-life, three-dimensional space is a great way to think about making a website. Translating depth and dimension to a flat plane unlocked a lot of possibilities for designing our digital space.</p><p>If you’ve ever approached a project as though it’s a totally different medium, I’d be excited to hear what you learned.</p>",
            "url": "https://perrera.com/2017/reconsidering-digital-space/",
            
            
            
            
            
            "date_published": "2017-11-02T00:00:00+00:00",
            "date_modified": "2017-11-02T00:00:00+00:00",
            "author": {
                "name": "Amy Parker"
            }
        },
    
        {
            "id": "https://perrera.com/2017/the-value-of-experimentation/",
            "title": "The Value of Experimentation",
            "summary": null,
            "content_text": "Earlier this month, Fore Design turned three and to celebrate, we launched the seventh version of our website. That sounds like a lot but we’ve found that experimenting with our own properties has been a valuable way to improve our craft. It gives us a space to test out ideas, critique our process, question closely held beliefs, and experiment with new technologies before we roll them out for clients.For example, the previous version of our website was the first time we experimented with Tachyons and since then, we’ve fully embraced it in our process. In this version of our website, we&#8217;re testing out ideas about how flexible our brand can be, smashing our preconceived notions of navigation, and turning the dial up on our minimalist aesthetic.The most noticeable change is our exploration of how interface animations might holistically work within a design system to make it more exciting and intuitive. To accomplish this we used Vue.js and Nuxt.js to see how we could make more dynamic experiences that work well responsively without sacrificing performance.    Your browser does not support the video tag.This was also the first time we approached a website project through a different lens — as though it were a physical, three-dimensional space. Thinking about a project like it’s in another medium changed our mindset about common paradigms like menus, navigation, and page transitions and allowed us to create new patterns.The result is what I believe is our most refined piece of web design yet. It doesn&#8217;t set out to evoke a printed piece but I think it captures the same level of consideration. We&#8217;re really pleased with how it turned out and would love to hear what you think.",
            "content_html": "<p>Earlier this month, Fore Design turned three and to celebrate, we launched the seventh version of our website. That sounds like a lot but we’ve found that experimenting with our own properties has been a valuable way to improve our craft. It gives us a space to test out ideas, critique our process, question closely held beliefs, and experiment with new technologies before we roll them out for clients.</p><p>For example, the previous version of our website was the first time we experimented with <a href=\"https://perrera.com/2017/designing-with-tachyons/\">Tachyons</a> and since then, we’ve fully embraced it in our process. In this version of our website, we&#8217;re testing out ideas about how flexible our brand can be, smashing our preconceived notions of navigation, and turning the dial up on our minimalist aesthetic.</p><p>The most noticeable change is our exploration of how interface animations might holistically work within a design system to make it more exciting and intuitive. To accomplish this we used <a href=\"https://vuejs.org\">Vue.js</a> and <a href=\"https://nuxtjs.org\">Nuxt.js</a> to see how we could make more dynamic experiences that work well responsively without sacrificing performance.</p><video class=\"w-100 pv2\" controls=\"\" poster=\"/assets/fore-website-2017.png\">  <source src=\"/assets/fore-website-2017.mp4\" type=\"video/mp4\" />  Your browser does not support the video tag.</video><p>This was also the first time we approached a website project through a different lens — as though it were a physical, three-dimensional space. Thinking about a project like it’s in another medium changed our mindset about common paradigms like menus, navigation, and page transitions and allowed us to create new patterns.</p><p>The <a href=\"https://foredesign.co\">result</a> is what I believe is our most refined piece of web design yet. It doesn&#8217;t set out to evoke a printed piece but I think it captures the same level of consideration. We&#8217;re really pleased with how it turned out and would love to hear what you think.</p>",
            "url": "https://perrera.com/2017/the-value-of-experimentation/",
            
            
            
            
            
            "date_published": "2017-10-24T00:00:00+00:00",
            "date_modified": "2017-10-24T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2017/unlocking-creativity/",
            "title": "Unlocking Creativity",
            "summary": null,
            "content_text": "Last month, the good folks at Dribbble asked me to be on a panel at their inaugural Hang Time conference. The focus of the discussion was on tapping into your full creative potential, getting past creative blocks, and staying inspired. As a business owner, designer, and side-project enthusiast, here’s what I had to say:How do you get inspired?While I definitely look at other designers’ work to see what’s possible or how someone else has approached a problem, I also love to look outside of design for inspiration. Architecture, photography, fine art — even urban planning — are all great sources of inspiration. Seeing how Charles Sheeler used photography to inform his drawings or how Picasso approached a portrait helps me find inspiration in objects I might normally overlook or view as uninspiring.Approaching a project as though its in a totally different medium — for instance, thinking about a website like a three-dimensional space or approaching an animation like it’s a museum exhibit — also helps me to get excited and think about the problem differently.Are rituals important to get you in a creative headspace?No, though I’ve got to make sure I’ve taken care of anything and everything that might prevent me from fully focusing on what I’m working on. I’ve also got a particular chair I need to sit in if I’m going to do my best work — I just can’t think clearly anywhere else!What does your creative process look like?It looks a lot like I’m not doing anything. After I gather all the data I need to tackle a problem, I spend as much time as I can thinking and avoiding starting actual “work.” I usually walk the dog, cook, bake, or watch baseball while my brain subconsciously churns on an idea.I also take this time to look for inspiration (see question no. 1) and filter it through the parameters of the project, sifting out what doesn’t make sense and translating interesting ideas into realistic solutions.At this stage, I avoid saving images or making detailed sketches of things I’m seeing. Instead, I try to study what’s working, understand the formula behind the solution, and apply that to the problem I’m working on. This way, I (hopefully) avoid making an exact copy and come up with something that’s both appropriate and unique.How do side projects help you tap into creativity?With no externally imposed restrictions, limitations, or time limits, side projects allow me to explore what’s possible, push boundaries, learn new skills, and try things out I’m not sure about. I find it also boosts my confidence in my ability to create something and I think that comes across in my client work.In the case of our Print &amp; Protest poster series, it also helped us express our opinions, contribute to a more important cause, and release some stress around the 2016 election.How do you get past imposter syndrome or your inner critic?I think about something I’m bad at so that, by comparison, I feel pretty knowledgable about design. If that doesn’t work, I think about explaining something like HTML, InDesign paragraph styles, or the game of baseball to someone who knows nothing about those topics and it quickly becomes apparent how much I know.I also read an interview recently with one of my favorite designers and he revealed that he gets inspired and gathers ideas the same way I (and, I imagine, a lot of us) do: flipping through Instagram and Pinterest and looking at other graphic design work. What I took away from this is that there’s not a secret, magical method to getting inspired or producing top-notch work — it’s whatever works for you.How does fear or failure play a role in the creative process?Running a small studio, I know that if we’re not constantly putting out our absolute best work, we won’t get new clients and we’ll go out of business. That’s the ultimate failure — and motivator!",
            "content_html": "<p>Last month, the good folks at <a href=\"https://dribbble.com\">Dribbble</a> asked me to be on a panel at their inaugural <a href=\"https://dribbble.com/hangtime\">Hang Time</a> conference. The focus of the discussion was on tapping into your full creative potential, getting past creative blocks, and staying inspired. As a business owner, designer, and side-project enthusiast, here’s what I had to say:</p><h2 id=\"how-do-you-get-inspired\">How do you get inspired?</h2><p>While I definitely look at other designers’ work to see what’s possible or how someone else has approached a problem, I also love to look outside of design for inspiration. Architecture, photography, fine art — even urban planning — are all great sources of inspiration. Seeing how Charles Sheeler <a href=\"http://www.mfa.org/exhibitions/charles-sheeler-from-doylestown-to-detroit\">used photography</a> to inform his drawings or how Picasso approached a portrait helps me find inspiration in objects I might normally overlook or view as uninspiring.</p><p>Approaching a project as though its in a totally different medium — for instance, thinking about a website like a three-dimensional space or approaching an animation like it’s a museum exhibit — also helps me to get excited and think about the problem differently.</p><h2 id=\"are-rituals-important-to-get-you-in-a-creative-headspace\">Are rituals important to get you in a creative headspace?</h2><p>No, though I’ve got to make sure I’ve taken care of anything and everything that might prevent me from fully focusing on what I’m working on. I’ve also got a particular chair I need to sit in if I’m going to do my best work — I just can’t think clearly anywhere else!</p><h2 id=\"what-does-your-creative-process-look-like\">What does your creative process look like?</h2><p>It looks a lot like I’m not doing anything. After I gather all the data I need to tackle a problem, I spend as much time as I can thinking and avoiding starting actual “work.” I usually walk the dog, cook, bake, or watch baseball while my brain subconsciously churns on an idea.</p><p>I also take this time to look for inspiration (see question no. 1) and filter it through the parameters of the project, sifting out what doesn’t make sense and translating interesting ideas into realistic solutions.</p><p>At this stage, I avoid saving images or making detailed sketches of things I’m seeing. Instead, I try to study what’s working, understand the formula behind the solution, and apply that to the problem I’m working on. This way, I (hopefully) avoid making an exact copy and come up with something that’s both appropriate and unique.</p><h2 id=\"how-do-side-projects-help-you-tap-into-creativity\">How do side projects help you tap into creativity?</h2><p>With no externally imposed restrictions, limitations, or time limits, side projects allow me to explore what’s possible, push boundaries, learn new skills, and try things out I’m not sure about. I find it also boosts my confidence in my ability to create something and I think that comes across in my client work.</p><p>In the case of our <a href=\"https://foredesign.co/journal/2017/print-and-protest\">Print &amp; Protest</a> poster series, it also helped us express our opinions, contribute to a more important cause, and release some stress around the 2016 election.</p><h2 id=\"how-do-you-get-past-imposter-syndrome-or-your-inner-critic\">How do you get past imposter syndrome or your inner critic?</h2><p>I think about something I’m bad at so that, by comparison, I feel pretty knowledgable about design. If that doesn’t work, I think about explaining something like HTML, InDesign paragraph styles, or the game of baseball to someone who knows nothing about those topics and it quickly becomes apparent how much I know.</p><p>I also read an interview recently with one of my favorite designers and he revealed that he gets inspired and gathers ideas the same way I (and, I imagine, a lot of us) do: flipping through Instagram and Pinterest and looking at other graphic design work. What I took away from this is that there’s not a secret, magical method to getting inspired or producing top-notch work — it’s whatever works for you.</p><h2 id=\"how-does-fear-or-failure-play-a-role-in-the-creative-process\">How does fear or failure play a role in the creative process?</h2><p>Running a small studio, I know that if we’re not constantly putting out our absolute best work, we won’t get new clients and we’ll go out of business. That’s the ultimate failure — and motivator!</p>",
            "url": "https://perrera.com/2017/unlocking-creativity/",
            
            
            
            
            
            "date_published": "2017-10-20T00:00:00+00:00",
            "date_modified": "2017-10-20T00:00:00+00:00",
            "author": {
                "name": "Amy Parker"
            }
        },
    
        {
            "id": "https://perrera.com/2017/hang-time-2017/",
            "title": "Hang Time 2017",
            "summary": null,
            "content_text": "On October 4, Dribbble held its first ever conference — appropriately called Hang Time — in Boston. Attendees got treated to some inspiring talks from Debbie Millman, Kelli Anderson, Dan Mall, and Jon Contino, and Amy spoke on a panel about unlocking creativity.Instead of a blow-by-blow recap, we thought we’d capture some of the emergent themes we took away from the event because, although we’ve probably all heard these before, we can all stand to be encouraged by them again.Build Creative Confidence  Expect anything worthwhile to take a long time.— Debbie MillmanPutting work out in the world can be scary but building a practice of creating is key. Experimentation, learning, and persistence are important habits to support. No one is successful out of the gate but you have to start putting ideas out into the world in order to start the learning process.Don’t Wait for Permission  “Busy” is a decision. We don&#8217;t find time – we make it.— Debbie MillmanDesign is about solving problems and, for us as a community, that means having more agency in the decision-making process. Sometimes that means stepping into a larger role when collaborating with others and sometimes it means bringing your own ideas to fruition. Designers have the ability to make a large impact but it’s on each of us to make the time and take responsibility for our creative endeavors.Do What You LoveConversely, if something feels like a drag and you just don’t feel like you can make time for it, it’s probably because, in your heart of hearts, you’re not really that excited about it — and that’s okay. Find something that does excite you (like dreaming up a progressive utopia) and pursue that.Collaboration is KeyA number of speakers touched on this topic over the course of the day. No designer is an island and we wouldn’t even be designers if we weren’t working with others to solve problems. Whether you work as part of a larger team or work directly with clients, it’s important to get other voices involved in the process to nail the right solution.Get OutIf you’re waiting for creative inspiration to strike while you’re sitting at your computer, you’ll be waiting for a long time. Get out from behind your desk and go for a walk, hit the gym, visit a museum, or walk around a neighborhood to get a fresh perspective on things.It’s Okay to Break the Mold  Being unique is a forgotten trait.— Jon ContinoSo many of us are pushed into lives that are designed for us but technology has really given us the ability to work on our own terms. Incredible work is emerging from creatives who don’t conform to the factory schedule, instead working whenever they’re inspired.Part of being a designer is looking at the world differently and it’s gratifying to see society start to understand the value in making time and space for interesting work to happen. There’s no “right way” to design — we all can cultivate our own process.CommunityDan Mall gave a really great talk on incorporating more (and more diverse) people into the design industry, using his own apprenticeship model as an example. This tied nicely into the sense of community the overall Hang Time experience created, bringing designers of all different disciplines and niches together — something we don&#8217;t often get a chance to do in our area. We left feeling excited and inspired and we&#8217;d love to see more programming like this in the very near future.",
            "content_html": "<p><img src=\"/assets/hangtime.jpg\" alt=\"Hang Time Logo\" /></p><p>On October 4, Dribbble held its first ever conference — appropriately called <a href=\"https://dribbble.com/hangtime\">Hang Time</a> — in Boston. Attendees got treated to some inspiring talks from <a href=\"http://debbiemillman.com\">Debbie Millman</a>, <a href=\"http://kellianderson.com/blog/\">Kelli Anderson</a>, <a href=\"http://danmall.me\">Dan Mall</a>, and <a href=\"http://joncontino.com\">Jon Contino</a>, and Amy spoke on a panel about unlocking creativity.</p><p>Instead of a blow-by-blow recap, we thought we’d capture some of the emergent themes we took away from the event because, although we’ve probably all heard these before, we can all stand to be encouraged by them again.</p><h2 id=\"build-creative-confidence\">Build Creative Confidence</h2><blockquote>  <p>Expect anything worthwhile to take a long time.<br /><em>— Debbie Millman</em></p></blockquote><p>Putting work out in the world can be scary but building a practice of creating is key. Experimentation, learning, and persistence are important habits to support. No one is successful out of the gate but you have to start putting ideas out into the world in order to start the learning process.</p><h2 id=\"dont-wait-for-permission\">Don’t Wait for Permission</h2><blockquote>  <p>“Busy” is a decision. We don&#8217;t find time – we make it.<br /><em>— Debbie Millman</em></p></blockquote><p>Design is about solving problems and, for us as a community, that means having more agency in the decision-making process. Sometimes that means stepping into a larger role when collaborating with others and sometimes it means bringing your own ideas to fruition. Designers have the ability to make a large impact but it’s on each of us to make the time and take responsibility for our creative endeavors.</p><h2 id=\"do-what-you-love\">Do What You Love</h2><p>Conversely, if something feels like a drag and you just don’t feel like you can make time for it, it’s probably because, in your heart of hearts, you’re not really that excited about it — and that’s okay. Find something that does excite you (like dreaming up a <a href=\"http://theyesmen.org/index.php/portfolio_page/nyt-special-edition/\">progressive utopia</a>) and pursue that.</p><h2 id=\"collaboration-is-key\">Collaboration is Key</h2><p>A number of speakers touched on this topic over the course of the day. No designer is an island and we wouldn’t even be designers if we weren’t working with others to solve problems. Whether you work as part of a larger team or work directly with clients, it’s important to get other voices involved in the process to nail the right solution.</p><h2 id=\"get-out\">Get Out</h2><p>If you’re waiting for creative inspiration to strike while you’re sitting at your computer, you’ll be waiting for a long time. Get out from behind your desk and go for a walk, hit the gym, visit a museum, or walk around a neighborhood to get a fresh perspective on things.</p><h2 id=\"its-okay-to-break-the-mold\">It’s Okay to Break the Mold</h2><blockquote>  <p>Being unique is a forgotten trait.<br /><em>— Jon Contino</em></p></blockquote><p>So many of us are pushed into lives that are designed for us but technology has really given us the ability to work on our own terms. Incredible work is emerging from creatives who don’t conform to the factory schedule, instead working whenever they’re inspired.</p><p>Part of being a designer is looking at the world differently and it’s gratifying to see society start to understand the value in making time and space for interesting work to happen. There’s no “right way” to design — we all can cultivate our own process.</p><h2 id=\"community\">Community</h2><p><a href=\"http://danmall.me\">Dan Mall</a> gave a really great talk on incorporating more (and more diverse) people into the design industry, using his own <a href=\"http://superfriend.ly/academy/\">apprenticeship model</a> as an example. This tied nicely into the sense of community the overall Hang Time experience created, bringing designers of all different disciplines and niches together — something we don&#8217;t often get a chance to do in our area. We left feeling excited and inspired and we&#8217;d love to see more programming like this in the very near future.</p>",
            "url": "https://perrera.com/2017/hang-time-2017/",
            
            
            
            
            
            "date_published": "2017-10-09T00:00:00+00:00",
            "date_modified": "2017-10-09T00:00:00+00:00",
            "author": {
                "name": "Amy Parker and Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2017/exploring-design-directions/",
            "title": "Exploring Design Directions",
            "summary": null,
            "content_text": "Moodboards might sound like a fluffy art school concept but at Fore Design, they’re an invaluable tool in our design process. They’re essential for working out a visual direction and a great opportunity to get our clients involved where it makes sense for them to contribute their knowledge and perspective: in regard to their organization’s vision, goals, and brand voice.Working from the results of our Discovery phase, we figure out two or three different concepts that tie back to a project’s strategy, then start pulling color palettes, graphics, typefaces, and photography or illustration that might convey those concepts visually.We start by creating an Illustrator file with three artboards, each the size of the paper we’ll be printing on, then crack open Dribbble, Pinterest, Instagram, BP&amp;O, and the portfolios of some of our favorite design studios. Whatever catches our eye that fits the brief gets thrown onto one of the three boards until we feel like we’ve got enough to dig through. We’ll start sorting into logical groups, revising headings and keywords, and adding, deleting, and moving imagery until the directions start to feel visually distinct.This part of the process is not only fun, but freeing. It allows for completely noncommittal exploration. It’s the perfect place to try out trends or styles we’ve been interested in and if it turns out they don’t work for the project, we remove them, confident that we’ve explored fully and determined that this isn’t the right time or place to use them.If we’re lucky, some serendipitous connections will appear, unearthing some interesting concepts or ideas we hadn’t previously thought of. When that happens, we’ll rework the boards, tracking down specific images or graphics that support the new direction.Our goal is to create three unique directions that are as different from each other as possible while still making sense for the brand. We want to explore the poles of each concept so when we review, we can pull out the elements from each board that make the most sense.      We always print these out and walk our client through them in person, laying down each board one by one and giving a quick overview of the concept and its key visual elements. We ask for first impressions as soon as everything is on the table, then go through the individual elements on each board, discussing what each might say about the organization. It’s a pretty informal setting so we pull out a Sharpie and mark up the boards with comments, cross things out, and star and circle elements we love. At this point, we’re open to mixing and matching because it’s easier to do that now than when we’re in the midst of coding a huge marketing site or laying out a 40-page book.What this process ensures is that everyone involved understands exactly how we’ll translate key brand tenets to visual design. This is hugely important because everyone interprets words and language differently so this helps ensure everyone’s on the same page.Sometimes a single board hits the nail on the head while other times we pull elements from two or three boards to get the look and feel just right. If that’s the case, we’ll oftentimes create a “final” moodboard so we have something to refer back to while we’re designing. We’ll tape it on the wall over our desk to make sure we (literally) don’t lose sight of what we’re working toward.Moodboards are a great (and efficient) way to get everyone excited about and invested in the outcome of the project and ensure we don’t run into any major surprises or hiccups later on in the process.",
            "content_html": "<p>Moodboards might sound like a fluffy art school concept but at Fore Design, they’re an invaluable tool in our design process. They’re essential for working out a visual direction and a great opportunity to get our clients involved where it makes sense for them to contribute their knowledge and perspective: in regard to their organization’s vision, goals, and brand voice.</p><p>Working from the results of our <a href=\"/2017/the-art-of-asking-questions\">Discovery phase</a>, we figure out two or three different concepts that tie back to a project’s strategy, then start pulling color palettes, graphics, typefaces, and photography or illustration that might convey those concepts visually.</p><p>We start by creating an Illustrator file with three artboards, each the size of the paper we’ll be printing on, then crack open Dribbble, Pinterest, Instagram, BP&amp;O, and the portfolios of some of our favorite design studios. Whatever catches our eye that fits the brief gets thrown onto one of the three boards until we feel like we’ve got enough to dig through. We’ll start sorting into logical groups, revising headings and keywords, and adding, deleting, and moving imagery until the directions start to feel visually distinct.</p><p>This part of the process is not only fun, but freeing. It allows for completely noncommittal exploration. It’s the perfect place to try out trends or styles we’ve been interested in and if it turns out they don’t work for the project, we remove them, confident that we’ve explored fully and determined that this isn’t the right time or place to use them.</p><p>If we’re lucky, some serendipitous connections will appear, unearthing some interesting concepts or ideas we hadn’t previously thought of. When that happens, we’ll rework the boards, tracking down specific images or graphics that support the new direction.</p><p>Our goal is to create three unique directions that are as different from each other as possible while still making sense for the brand. We want to explore the poles of each concept so when we review, we can pull out the elements from each board that make the most sense.</p><div class=\"ba b--light-gray mb3\">  <img src=\"/assets/moodboard1.jpg\" class=\"db\" /></div><div class=\"ba b--light-gray mb3\">  <img src=\"/assets/moodboard2.jpg\" class=\"db\" /></div><div class=\"ba b--light-gray mb3\">  <img src=\"/assets/moodboard3.jpg\" class=\"db\" /></div><p>We always print these out and walk our client through them in person, laying down each board one by one and giving a quick overview of the concept and its key visual elements. We ask for first impressions as soon as everything is on the table, then go through the individual elements on each board, discussing what each might say about the organization. It’s a pretty informal setting so we pull out a Sharpie and mark up the boards with comments, cross things out, and star and circle elements we love. At this point, we’re open to mixing and matching because it’s easier to do that now than when we’re in the midst of coding a huge marketing site or laying out a 40-page book.</p><p>What this process ensures is that everyone involved understands exactly how we’ll translate key brand tenets to visual design. This is hugely important because everyone interprets words and language differently so this helps ensure everyone’s on the same page.</p><p>Sometimes a single board hits the nail on the head while other times we pull elements from two or three boards to get the look and feel just right. If that’s the case, we’ll oftentimes create a “final” moodboard so we have something to refer back to while we’re designing. We’ll tape it on the wall over our desk to make sure we (literally) don’t lose sight of what we’re working toward.</p><p>Moodboards are a great (and efficient) way to get everyone excited about and invested in the outcome of the project and ensure we don’t run into any major surprises or hiccups later on in the process.</p>",
            "url": "https://perrera.com/2017/exploring-design-directions/",
            
            
            
            
            
            "date_published": "2017-08-25T00:00:00+00:00",
            "date_modified": "2017-08-25T00:00:00+00:00",
            "author": {
                "name": "Amy Parker"
            }
        },
    
        {
            "id": "https://perrera.com/2017/better-together/",
            "title": "Better Together",
            "summary": null,
            "content_text": "I met my partner Amy in 2007. Since then we&#8217;ve done pretty much everything together, including starting our first business back in 2009.  Whenever I describe our life to someone, I almost always hear: “I could never work with my significant other&#8221; but that just doesn&#8217;t make sense to me.Maybe we&#8217;re just lucky but I can say without hesitation that we make each other better. We bounce ideas off of one another, talk things through, creatively support each other, and challenge each other to be better at anything we set out to do.In fact, there&#8217;s a small secret that I&#8217;ve been keeping from you: every single post on this site has been edited by her. We’ve discussed and teased apart nearly all of the articles before I publish them and they&#8217;re all better because of her.Even the recent redesign of the site was heavily influenced by her art direction. She pushed me to fully flesh out my idea and helped me clarify the interaction in a way that has made it a surprise success, being featured on SiteInspire, Designer News, and a number of other design inspiration sites.That’s why I was extremely excited when she finally expressed interest in writing as well. Since Perrera.com is really another one of our collaborations, I felt it made sense to have her join me here.Soon you&#8217;ll see some small design changes here as we evolve this site from being my personal blog to a joint publication but you can expect the same sort of design-focused writing as we use this space to explore ideas that are bigger than Fore Design alone.I&#8217;m so excited for Amy to add her voice. Stay tuned.",
            "content_html": "<p>I met my partner Amy in 2007. Since then we&#8217;ve done pretty much everything together, including starting our first business back in 2009.  Whenever I describe our life to someone, I almost always hear: “I could <em>never</em> work with my significant other&#8221; but that just doesn&#8217;t make sense to me.</p><p>Maybe we&#8217;re just lucky but I can say without hesitation that we make each other better. We bounce ideas off of one another, talk things through, creatively support each other, and challenge each other to be better at anything we set out to do.</p><p>In fact, there&#8217;s a small secret that I&#8217;ve been keeping from you: every single post on this site has been edited by her. We’ve discussed and teased apart nearly all of the articles before I publish them and they&#8217;re all better because of her.</p><p>Even the recent redesign of the site was heavily influenced by her art direction. She pushed me to fully flesh out my idea and helped me clarify the interaction in a way that has made it a surprise success, being featured on <a href=\"https://www.siteinspire.com/websites/7287-dan-perrera\">SiteInspire</a>, <a href=\"https://www.designernews.co/stories/84496-dan-perrera\">Designer News</a>, and a number of other <a href=\"https://onepagelove.com/dan-perrera\">design</a> <a href=\"https://siiimple.com/dan-perrera/\">inspiration</a> sites.</p><p>That’s why I was extremely excited when she finally expressed interest in writing as well. Since Perrera.com is really another one of our collaborations, I felt it made sense to have her join me here.</p><p>Soon you&#8217;ll see some small design changes here as we evolve this site from being my personal blog to a joint publication but you can expect the same sort of design-focused writing as we use this space to explore ideas that are bigger than <a href=\"https://foredesign.co\">Fore Design</a> alone.</p><p>I&#8217;m so excited for Amy to add her voice. Stay tuned.</p>",
            "url": "https://perrera.com/2017/better-together/",
            
            
            
            
            
            "date_published": "2017-08-08T00:00:00+00:00",
            "date_modified": "2017-08-08T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2017/the-art-of-asking-questions/",
            "title": "The Art of Asking Questions",
            "summary": null,
            "content_text": "As designers, our job is to understand problems and create appropriate solutions that can be quickly and clearly understood by others. But how exactly do we start to do that?At Fore Design, we kick off every project — no matter how big or small — with a Discovery session. Everyone involved in making decisions regarding the project is invited and we usually spend an hour or two together talking about anything and everything related to their organization, their customers or clients, products or services, and, most importantly, the project goals.Getting people to give us the information we need — even when we don’t know what that might be — is partially about knowing when to stop talking and listen but mostly about asking the right questions. Here’s how we go about figuring out what those questions are.The ProcessWhile specific questions vary from project to project, we always follow the same arc of “zooming in:” starting off by asking general questions until we understand enough to come up with more specific ones.We repeat this process with as many people as we can — both internally (others within our client’s organization) and externally (our client’s customer) — until we’re comfortable making a recommendation on how to proceed.Depending on the type of project we’re doing, our recommendations could take many forms — how to structure content on a website or in a print piece, what the visual direction of an identity system should be, or what language a brand might use to talk to customers, to name a few.We write up everything we learn along with our recommendations on how to proceed into a Findings and Recommendations document that we refer to throughout the project. It’s usually a little dry because we don’t want to start suggesting exact design solutions or copywriting yet, but it helps set everyone’s expectations and ensures that the rest of the project will go smoothly by clarifying that we heard everything correctly and making sure our client is comfortable with the direction we’re considering.Getting PreparedBefore we do a Discovery session, we like to familiarize ourselves with the sector our client is in, review their competition, and research their organization as though we’re prospective customers.We always take note of what we come across and jot down questions we have along the way because at the start of our research, we’re in the same beginner’s mindset as our client’s audience will be. If we have these questions now, it’s likely that someone coming to a website for the first time or picking up a brochure will have the same questions — and be searching for those answers. If we can provide them quickly and clearly, we’ll have a better chance of catching their attention and giving our client the opportunity to tell their story.Understanding Our ClientAs we go into a Discovery meeting, we know our job is to represent the audience. If we don’t think they would understand something, it’s our job during this process to clarify it so we can present it in a way that makes sense to them.The first thing we make sure to understand before we dive too deep into our questioning is the goal of the project. Does our client want to sell more product? Raise brand awareness? Attract a certain type of customer or get funding?Even more important is understanding why our client does what they do or, to put it bluntly: why do they exist? At this point, we’re trying to figure out what drives them because we want to capture their excitement and transmit that to their audience.To do that, we try to suss out what their differentiator is — why would a prospective customer choose them over a competitor? If our client is asking for time or money from someone, what would make them pay attention or open their wallet?It&#8217;s also important to note that the type of project we’re working on — a logo, a website, a book, etc. — informs the questions we ask. We probably don&#8217;t need to know how tech savvy our client&#8217;s audience is if we’re designing a logo but that would be quite useful to know if we’re making an e-commerce website.We don’t expect to become subject matter experts overnight however, with some research, we’re usually able to reach an advanced-beginner or intermediate level pretty quickly. We know we’re in good shape when we understand the common lingo in our client&#8217;s industry and understand what excites people about the area we’re researching.Interviewing the AudienceWhenever possible, we try to interview our clients&#8217; ideal customers or favorite clients. We like to set the stage for them by explaining who we are (a third party helping a client), what we’re hoping to achieve with the project (make more customers like them or build up a helpful support section, for instance), and make clear that the conversation is private. Not only does this lend a frame of reference for our questions, it helps whoever we’re talking to feel like they can speak freely without fear of offending anyone.It’s also important to learn where our interviewees are coming from so we can understand the context of their answers, that way we’re able to tailor our questions to make the most of our sessions.We always go into an interview with a list of questions informed by our research but we’re not concerned with checking them all off. At this point, we don’t know what we don’t know and by following the flow of a conversation, we may end up uncovering something more interesting than we anticipated. If we hear something that’s especially insightful or important to the task at hand, we try to pull on that thread. The most helpful information is usually a few layers deep in someone&#8217;s mind — things an expert might write off as obvious might help a novice connect the dots — so we keep asking “why” until we find the central point of each thought.As we’re talking to people, we make sure to give them the time and respect to complete their thoughts but we aren’t embarrassed to ask for clarification if there’s something we don’t understand. We also try to show our interviewee that we’re interested in the subject matter and are excited by what we’re learning. A conversation is a two-way street and the energy we put in is usually returned in the form of helpful insights.Summing It UpWhile we try to take detailed notes during Discovery meetings or interviews, they typically make for a poor reference so after every conversation, we write up a summary of our impressions, main takeaways, and any context that qualifies what we’ve learned.The goal of this phase is to learn how to take the audience from introduction to understanding in a way that feels effortless to them. By the time we’ve completed all of our meetings, research, and interviews for a project, we’re usually able to recognize some trends which help us distill the themes that will inform the rest of the project including messaging, look and feel, and layout. Further, we’re pretty much able to anticipate what the audience will want to know and when.When working on our recommendations or the end product, we like to keep in mind that the audience isn’t captive. We know we have to earn their attention and we do that in part by being respectful of them and their time — helping them accomplish something or solve a problem they have as quickly and easily as possible.Practicing Our ArtWe’re always trying to improve our own question-asking skills and one way we do this is by listening to great interviewers. They’re easy to identify because they can talk to almost anyone about anything and the conversation is captivating.Some people we consider to be great interviewers are Rachel Maddow, Ezra Klein, and the duo of Jessica Helfand and Michael Bierut on the The Design of Business Podcast. If you get a chance to listen to any of their interviews, pay attention to how the questions are asked, the pauses for clarification, and how follow-up questions add important context to the information being shared.Asking questions is truly an art and like anything, you get better at it with practice. If you have questions about asking questions, we’d be happy to answer.",
            "content_html": "<p>As designers, our job is to understand problems and create appropriate solutions that can be quickly and clearly understood by others. But how exactly do we start to do that?</p><p>At <a href=\"https://foredesign.co\">Fore Design</a>, we kick off every project — no matter how big or small — with a Discovery session. Everyone involved in making decisions regarding the project is invited and we usually spend an hour or two together talking about anything and everything related to their organization, their customers or clients, products or services, and, most importantly, the project goals.</p><p>Getting people to give us the information we need — even when we don’t know what that might be — is partially about knowing when to stop talking and listen but mostly about asking the right questions. Here’s how we go about figuring out what those questions are.</p><h2 id=\"the-process\">The Process</h2><p>While specific questions vary from project to project, we always follow the same arc of “zooming in:” starting off by asking general questions until we understand enough to come up with more specific ones.</p><p>We repeat this process with as many people as we can — both internally (others within our client’s organization) and externally (our client’s customer) — until we’re comfortable making a recommendation on how to proceed.</p><p>Depending on the type of project we’re doing, our recommendations could take many forms — how to structure content on a website or in a print piece, what the visual direction of an identity system should be, or what language a brand might use to talk to customers, to name a few.</p><p>We write up everything we learn along with our recommendations on how to proceed into a Findings and Recommendations document that we refer to throughout the project. It’s usually a little dry because we don’t want to start suggesting exact design solutions or copywriting yet, but it helps set everyone’s expectations and ensures that the rest of the project will go smoothly by clarifying that we heard everything correctly and making sure our client is comfortable with the direction we’re considering.</p><h2 id=\"getting-prepared\">Getting Prepared</h2><p>Before we do a Discovery session, we like to familiarize ourselves with the sector our client is in, review their competition, and research their organization as though we’re prospective customers.</p><p>We always take note of what we come across and jot down questions we have along the way because at the start of our research, we’re in the same beginner’s mindset as our client’s audience will be. If we have these questions now, it’s likely that someone coming to a website for the first time or picking up a brochure will have the same questions — and be searching for those answers. If we can provide them quickly and clearly, we’ll have a better chance of catching their attention and giving our client the opportunity to tell their story.</p><h2 id=\"understanding-our-client\">Understanding Our Client</h2><p>As we go into a Discovery meeting, we know our job is to represent the audience. If we don’t think they would understand something, it’s our job during this process to clarify it so we can present it in a way that makes sense to them.</p><p>The first thing we make sure to understand before we dive too deep into our questioning is the goal of the project. Does our client want to sell more product? Raise brand awareness? Attract a certain type of customer or get funding?</p><p>Even more important is understanding <strong>why</strong> our client does what they do or, to put it bluntly: why do they exist? At this point, we’re trying to figure out what drives them because we want to capture their excitement and transmit that to their audience.</p><p>To do that, we try to suss out what their differentiator is — why would a prospective customer choose them over a competitor? If our client is asking for time or money from someone, what would make them pay attention or open their wallet?</p><p>It&#8217;s also important to note that the type of project we’re working on — a logo, a website, a book, etc. — informs the questions we ask. We probably don&#8217;t need to know how tech savvy our client&#8217;s audience is if we’re designing a logo but that would be quite useful to know if we’re making an e-commerce website.</p><p>We don’t expect to become subject matter experts overnight however, with some research, we’re usually able to reach an advanced-beginner or intermediate level pretty quickly. We know we’re in good shape when we understand the common lingo in our client&#8217;s industry and understand what excites people about the area we’re researching.</p><h2 id=\"interviewing-the-audience\">Interviewing the Audience</h2><p>Whenever possible, we try to interview our clients&#8217; ideal customers or favorite clients. We like to set the stage for them by explaining who we are (a third party helping a client), what we’re hoping to achieve with the project (make more customers like them or build up a helpful support section, for instance), and make clear that the conversation is private. Not only does this lend a frame of reference for our questions, it helps whoever we’re talking to feel like they can speak freely without fear of offending anyone.</p><p>It’s also important to learn where our interviewees are coming from so we can understand the context of their answers, that way we’re able to tailor our questions to make the most of our sessions.</p><p>We always go into an interview with a list of questions informed by our research but we’re not concerned with checking them all off. At this point, we don’t know what we don’t know and by following the flow of a conversation, we may end up uncovering something more interesting than we anticipated. If we hear something that’s especially insightful or important to the task at hand, we try to pull on that thread. The most helpful information is usually a few layers deep in someone&#8217;s mind — things an expert might write off as obvious might help a novice connect the dots — so we keep asking “why” until we find the central point of each thought.</p><p>As we’re talking to people, we make sure to give them the time and respect to complete their thoughts but we aren’t embarrassed to ask for clarification if there’s something we don’t understand. We also try to show our interviewee that we’re interested in the subject matter and are excited by what we’re learning. A conversation is a two-way street and the energy we put in is usually returned in the form of helpful insights.</p><h2 id=\"summing-it-up\">Summing It Up</h2><p>While we try to take detailed notes during Discovery meetings or interviews, they typically make for a poor reference so after every conversation, we write up a summary of our impressions, main takeaways, and any context that qualifies what we’ve learned.</p><p>The goal of this phase is to learn how to take the audience from introduction to understanding in a way that feels effortless to them. By the time we’ve completed all of our meetings, research, and interviews for a project, we’re usually able to recognize some trends which help us distill the themes that will inform the rest of the project including messaging, look and feel, and layout. Further, we’re pretty much able to anticipate what the audience will want to know and when.</p><p>When working on our recommendations or the end product, we like to keep in mind that the audience isn’t captive. We know we have to earn their attention and we do that in part by being respectful of them and their time — helping them accomplish something or solve a problem they have as quickly and easily as possible.</p><h2 id=\"practicing-our-art\">Practicing Our Art</h2><p>We’re always trying to improve our own question-asking skills and one way we do this is by listening to great interviewers. They’re easy to identify because they can talk to almost anyone about anything and the conversation is captivating.</p><p>Some people we consider to be great interviewers are <a href=\"http://www.msnbc.com/maddowblog\">Rachel Maddow</a>, <a href=\"https://itunes.apple.com/us/podcast/the-ezra-klein-show/id1081584611?mt=2\">Ezra Klein</a>, and the duo of Jessica Helfand and Michael Bierut on the <a href=\"https://soundcloud.com/designofbusiness-businessofdesign\">The Design of Business Podcast</a>. If you get a chance to listen to any of their interviews, pay attention to how the questions are asked, the pauses for clarification, and how follow-up questions add important context to the information being shared.</p><p>Asking questions is truly an art and like anything, you get better at it with practice. If you have questions about asking questions, <a href=\"mailto:hello@foredesign.co\">we’d be happy to answer</a>.</p>",
            "url": "https://perrera.com/2017/the-art-of-asking-questions/",
            
            
            
            
            
            "date_published": "2017-07-18T00:00:00+00:00",
            "date_modified": "2017-07-18T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2017/why-not-learn-to-code/",
            "title": "Why Not Learn to Code?",
            "summary": null,
            "content_text": "Earlier this year, I found myself preparing to teach a class on interactive design at Boston University and was faced with an interesting question: how do you teach interactive design in 2017?When I was an undergrad in the early 2000s, the comparable class taught Adobe Flash. I took printmaking instead. I did, however, buy a book on Flash and taught myself how to use it so as not to fall behind.I didn’t use Flash for long though. The idea of requiring a plugin to run my website wasn’t appealing to me so as soon as I discovered Jeffery Zeldman’s Designing with Web Standards, I went down the HTML, CSS, JavaScript road.This past winter, as I was preparing my syllabus, it struck me that a course covering HTML and CSS 13 years ago would have taught me skills that I’d still be using today so I decided to teach the class I wish I’d had (albeit a much nicer experience after a decade of progress on the web).I decided I’d focus on using web technologies as design tools since they’re ubiquitous, not to mention that it’s downright fun to get immediate results from typing some code into a document and seeing it appear in your browser.I’m not trying to rehash the “designers should code” argument but ponder why some designers feel like coding is outside their domain, tease apart why front-end development seems so intimidating, and, if you’re a reluctant designer, maybe convince you to give coding a try.An Irrational Fear of CodeAt the start of my class at BU this year, I asked who was nervous about writing code and, understandably, nearly every hand shot up. Designers today are used to manipulating design software like Adobe Illustrator, Photoshop, or Sketch to achieve their designs and stripping away a graphical user interface is like taking away a security blanket — at least it was for me when I first started.This fear isn’t isolated to students either. It stills surprises me when I speak to colleagues who describe themselves as knowing a bit of HTML but who don’t feel capable of writing “production code.”I think everyone is selling themselves short and probably falling prey to a few common misconceptions:“I’m not smart enough to code.”We understand coding to be inherently complicated — which it can be, as anything is when you’re first starting out. I think designers often conflate front-end development with computer scientists or hackers but that couldn’t be farther from the truth.To be honest, the software designers use on a day-to-day basis is far more complex than HTML and CSS. HTML is merely a structured outline of your content and CSS is a description of the styling and layout you’re aiming to achieve. Your web browser is built to read these instructions and interpret them into a design and once you understand the rules, you’ll be able to write those instructions yourself.JavaScript is a bit more complex than either HTML or CSS but it also has a logical underpinning that you can understand with practice.“I can’t produce perfect code, so I’m not fit for the job.”The other thing that is frequently misunderstood is the idea of “production code” or code that has been magically optimized for distribution. It’s always a good idea to optimize your code but the fact is, it’s a game of shaving milliseconds off of load times. This is critical for big businesses but for the great majority of us, it just isn’t that big of a deal.For some, there is a secondary pressure that the quality of your code might be judged by your peers but this virtually never happens. If your design looks good in the browser, it’s a success. If it looks broken, it’s not. This isn’t to say that you shouldn’t optimize your website but you can achieve incredible results by only optimizing your images and leaving your code alone.“There’s so much to know, I’ll never be able to learn it all.”This isn’t totally false but I’m guessing that you don’t know how everything in your graphics editor works either. (Who does?)HTML and CSS are pretty extensive and nearly impossible to learn completely by heart but the good news is: you don’t need to. You could build a website with only a handful of HTML and CSS tags and it would totally work. It’s far more important to understand the concepts of the technology rather than it’s entire specification.Working in code is all about breaking your problems down to their tiniest pieces and solving each piece to achieve your design goal. As you do this, you’ll quickly learn how these tools work.And if you do get stuck, there are plenty of references, online and off, to get you unstuck.Getting Over ItRemember all those students in my class who were afraid of code? Fifteen weeks later, every student walked away with two websites under their belts and skills they can build on for the rest of their careers. They embraced the challenge of making design decisions in the browser and found joy in the small successes along the way. You can do it too so the question remains: why not learn to code?If you’re looking for a place to start, I’d suggest this fantastic getting started guide from Mozilla .",
            "content_html": "<p>Earlier this year, I found myself preparing to teach a class on interactive design at Boston University and was faced with an interesting question: how do you teach interactive design in 2017?</p><p>When I was an undergrad in the early 2000s, the comparable class taught Adobe Flash. I took printmaking instead. I did, however, buy a book on Flash and taught myself how to use it so as not to fall behind.</p><p>I didn’t use Flash for long though. The idea of requiring a plugin to run my website wasn’t appealing to me so as soon as I discovered Jeffery Zeldman’s <em>Designing with Web Standards</em>, I went down the HTML, CSS, JavaScript road.</p><p>This past winter, as I was preparing my syllabus, it struck me that a course covering HTML and CSS 13 years ago would have taught me skills that I’d still be using today so I decided to teach the class I wish I’d had (albeit a much nicer experience after a decade of progress on the web).</p><p>I decided I’d focus on using web technologies as design tools since they’re ubiquitous, not to mention that it’s downright fun to get immediate results from typing some code into a document and seeing it appear in your browser.</p><p>I’m not trying to rehash the “designers should code” argument but ponder why some designers feel like coding is outside their domain, tease apart why front-end development seems so intimidating, and, if you’re a reluctant designer, maybe convince you to give coding a try.</p><h2 id=\"an-irrational-fear-of-code\">An Irrational Fear of Code</h2><p>At the start of my class at BU this year, I asked who was nervous about writing code and, understandably, nearly every hand shot up. Designers today are used to manipulating design software like Adobe Illustrator, Photoshop, or Sketch to achieve their designs and stripping away a graphical user interface is like taking away a security blanket — at least it was for me when I first started.</p><p>This fear isn’t isolated to students either. It stills surprises me when I speak to colleagues who describe themselves as knowing a bit of HTML but who don’t feel capable of writing “production code.”</p><p>I think everyone is selling themselves short and probably falling prey to a few common misconceptions:</p><h3 id=\"im-not-smart-enough-to-code\">“I’m not smart enough to code.”</h3><p>We understand coding to be inherently complicated — which it can be, as anything is when you’re first starting out. I think designers often conflate front-end development with computer scientists or hackers but that couldn’t be farther from the truth.</p><p>To be honest, the software designers use on a day-to-day basis is far more complex than HTML and CSS. HTML is merely a structured outline of your content and CSS is a description of the styling and layout you’re aiming to achieve. Your web browser is built to read these instructions and interpret them into a design and once you understand the rules, you’ll be able to write those instructions yourself.</p><p>JavaScript is a bit more complex than either HTML or CSS but it also has a logical underpinning that you can understand with practice.</p><h3 id=\"i-cant-produce-perfect-code-so-im-not-fit-for-the-job\">“I can’t produce perfect code, so I’m not fit for the job.”</h3><p>The other thing that is frequently misunderstood is the idea of “production code” or code that has been magically optimized for distribution. It’s always a good idea to optimize your code but the fact is, it’s a game of shaving milliseconds off of load times. This is critical for big businesses but for the great majority of us, it just isn’t that big of a deal.</p><p>For some, there is a secondary pressure that the quality of your code might be judged by your peers but this virtually never happens. If your design looks good in the browser, it’s a success. If it looks broken, it’s not. This isn’t to say that you shouldn’t optimize your website but you can achieve incredible results by only optimizing your images and leaving your code alone.</p><h3 id=\"theres-so-much-to-know-ill-never-be-able-to-learn-it-all\">“There’s so much to know, I’ll never be able to learn it all.”</h3><p>This isn’t totally false but I’m guessing that you don’t know how everything in your graphics editor works either. (Who does?)</p><p>HTML and CSS are pretty extensive and nearly impossible to learn completely by heart but the good news is: you don’t need to. You could build a website with only a handful of HTML and CSS tags and it would totally work. It’s far more important to understand the concepts of the technology rather than it’s entire specification.</p><p>Working in code is all about breaking your problems down to their tiniest pieces and solving each piece to achieve your design goal. As you do this, you’ll quickly learn how these tools work.</p><p>And if you do get stuck, there are plenty of references, online and off, to get you unstuck.</p><h2 id=\"getting-over-it\">Getting Over It</h2><p>Remember all those students in my class who were afraid of code? Fifteen weeks later, every student walked away with two websites under their belts and skills they can build on for the rest of their careers. They embraced the challenge of making design decisions in the browser and found joy in the small successes along the way. You can do it too so the question remains: why not learn to code?</p><p>If you’re looking for a place to start, I’d suggest this fantastic <a href=\"https://developer.mozilla.org/en-US/docs/Learn/Getting_started_with_the_web/Dealing_with_files\">getting started guide from Mozilla</a> .</p>",
            "url": "https://perrera.com/2017/why-not-learn-to-code/",
            
            
            
            
            
            "date_published": "2017-07-07T00:00:00+00:00",
            "date_modified": "2017-07-07T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2017/time-to-think/",
            "title": "Time to Think",
            "summary": null,
            "content_text": "At Fore Design, we’re constantly reevaluating our design process. We’re obsessive about putting each part under the microscope and figuring out what works and what doesn’t and, in doing so, we’ve noticed a trend: projects in which we schedule time to think come out better.It&#8217;s been invaluable for us to leave enough time to not work while ideas are swirling around and we’re still forming connections in our minds. Further, we never want to rush a client into an important decision based on a day on the calendar – unless it truly is an immovable object — because, in reality, there is almost never a date that is more important than a job well done.Form ConnectionsThe first part of any project is a discovery phase in which we take in as much information as we can. Usually it’s a lot of content from disparate sources and transforming this raw data into a clear strategy and a standout design takes time and consideration. Our brains can make amazing connections when they&#8217;re allowed to subconsciously process information.It’s worth noting that this works both ways. Our clients are partners in the design process and need time to think too. When they have that luxury, they&#8217;ll make thoughtful, considered decisions that likely won&#8217;t need to be revised later on in the process.Support a Reflective ProcessSome of our best ideas have happened on our morning dog walks or over dinner conversations so it makes a lot of sense to separate the value of our work from an hourly rate. We’ve found that project- and value-based pricing is the best way to ensure we deliver results that meet our standards and helps alleviate the perception that all of our work happens at our desks or that we need to start or stop thinking about something at a certain time.While we’re always sensitive to deadlines, it&#8217;s critical to build realistic project schedules that don’t rush the design or decision-making processes. There&#8217;s a natural tension there but I always remind myself that our clients hire us to do our best work, not our fastest work.",
            "content_html": "<p>At Fore Design, we’re constantly reevaluating our design process. We’re obsessive about putting each part under the microscope and figuring out what works and what doesn’t and, in doing so, we’ve noticed a trend: projects in which we schedule time to think come out better.</p><p>It&#8217;s been invaluable for us to leave enough time to <em>not</em> work while ideas are swirling around and we’re still forming connections in our minds. Further, we never want to rush a client into an important decision based on a day on the calendar – unless it truly is an immovable object — because, in reality, there is almost never a date that is more important than a job well done.</p><h2 id=\"form-connections\">Form Connections</h2><p>The first part of any project is a discovery phase in which we take in as much information as we can. Usually it’s a lot of content from disparate sources and transforming this raw data into a clear strategy and a standout design takes time and consideration. Our brains can make amazing connections when they&#8217;re allowed to subconsciously process information.</p><p>It’s worth noting that this works both ways. Our clients are partners in the design process and need time to think too. When they have that luxury, they&#8217;ll make thoughtful, considered decisions that likely won&#8217;t need to be revised later on in the process.</p><h2 id=\"support-a-reflective-process\">Support a Reflective Process</h2><p>Some of our best ideas have happened on our morning dog walks or over dinner conversations so it makes a lot of sense to separate the value of our work from an hourly rate. We’ve found that project- and value-based pricing is the best way to ensure we deliver results that meet our standards and helps alleviate the perception that all of our work happens at our desks or that we need to start or stop thinking about something at a certain time.</p><p>While we’re always sensitive to deadlines, it&#8217;s critical to build realistic project schedules that don’t rush the design or decision-making processes. There&#8217;s a natural tension there but I always remind myself that our clients hire us to do our best work, not our fastest work.</p>",
            "url": "https://perrera.com/2017/time-to-think/",
            
            
            
            
            
            "date_published": "2017-06-23T00:00:00+00:00",
            "date_modified": "2017-06-23T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2017/designing-with-tachyons/",
            "title": "Designing with Tachyons",
            "summary": null,
            "content_text": "Last year I started developing a CSS mini-framework to use on Fore Design projects. Designed around a flexible grid system, it had a handful of pithy classes like title, headline, and  intro and was meant to be designer friendly, semantic, modular, and extendible. The idea was to make something that helped Amy and I execute our then-new web design process that started with a clickable outline and, over time, evolved into a finished website. I struggled to create a system that could smoothly make the transition but also offered enough design flexibility to satisfy our needs. In a bout of frustration I gave Tachyons a try.At first I hated it. All of the classes in my HTML looked ugly and seemed inscrutable. Furthermore, this technique seemed to violate everything I knew about CSS, the benefits of the cascade, and semantic naming. Still I pushed forward with the idea that it’s good to challenge your habits and, as I grew to understand and trust the conventions of the Tachyons design system, I began to love it.What is Tachyons?At its most basic, Tachyons is a bunch of tiny utility classes that map to CSS properties that can be chained together to create design. You might be tempted to think of Tachyons as a CSS framework but it’s not really. There aren’t any nav bars or default button styles or other design decisions to pollute your blank canvas. Instead, it’s built around a scale that governs type size and measurements for padding, margins, and other properties where size comes into play. For instance, if you wanted to make a big, bold, blue headline, it might look like this:&lt;h1 class=\"f2 b blue”&gt;Hello Tachyons!&lt;/h1&gt;Tachyons also elegantly handles responsive design with breakpoints for “not small,” “medium,” and “large.” So if we wanted our headline to be responsive, it might look like this:&lt;h1 class=\"f3 f2-m f1-l b blue”&gt;Hello Tachyons!&lt;/h1&gt;If you’re interested in learning more about Tachyons’ technical qualities or how to use it, you should read the documentation or, if you’re looking for examples of Tachyons in action, you can view the source code for a few of the sites we’ve built with it: Shubox and Fore Design.For now, I want to focus on the tangible benefits Amy and I have experienced as a design team.VelocityNot long after experimenting with Tachyons, it became clear that semantics were holding us back from making design decisions and quickly iterating in the browser. Not only did we have to make the actual design decision, but then we needed to figure out what to call it, how to structure it, make sure there weren’t any naming conflicts, etc.With Tachyons’ functional approach, we didn’t need to worry about what to call different elements. We could design in a much more fluid way because we were making the majority of our design notation in HTML, therefore writing way less CSS and switching contexts less often.StabilityYou might be thinking, “What if I want all my headlines to be a different color? Won’t I need to go back and change all those classes?” Yes, you will, and that can be a substantial effort if you’re making a change late in the process, however; if you’ve worked on any code base of sufficient size, you’ll know the feeling of dread of understanding the code, let alone deleting or making a significant change. The fear of unexpected consequences either becomes paralyzing or leads to bloated CSS.With Tachyons, we felt like we were given the license to experiment, evolve our design systems, and make granular design decisions. Finding and replacing classes doesn’t seem like a bad compromise when you’re gaining creative flexibility along with stability in your code. There’s a liberation to knowing that your site will never appear to be broken to the end user and, because there’s a predesigned scale, nothing will ever look truly out-of-whack even if it doesn’t adhere to your style guide 100 percent.EfficiencyFor us, Tachyons eased the transition from design software to code editor so much so that we’ve completely cut making comps out of our process.One big, albeit unsurprising, benefit from working directly in the medium of the web is that we’ve been able to experiment and push our design and technical boundaries further — with much less time and effort.I’d love to hear whether anyone is using Tachyons currently and what your experience has been like. And if you haven’t tried it yet, I’d love to know if you do.",
            "content_html": "<p>Last year I started developing a CSS mini-framework to use on Fore Design projects. Designed around a flexible grid system, it had a handful of pithy classes like <code class=\"highlighter-rouge\">title</code>, <code class=\"highlighter-rouge\">headline</code>, and  <code class=\"highlighter-rouge\">intro</code> and was meant to be designer friendly, semantic, modular, and extendible. The idea was to make something that helped Amy and I execute our then-new web design process that started with a clickable outline and, over time, evolved into a finished website. I struggled to create a system that could smoothly make the transition but also offered enough design flexibility to satisfy our needs. In a bout of frustration I gave <a href=\"http://tachyons.io\">Tachyons</a> a try.</p><p>At first I hated it. All of the classes in my HTML looked ugly and seemed inscrutable. Furthermore, this technique seemed to violate everything I knew about CSS, the benefits of the cascade, and semantic naming. Still I pushed forward with the idea that it’s good to challenge your habits and, as I grew to understand and trust the conventions of the Tachyons design system, I began to love it.</p><h2 id=\"what-is-tachyons\">What is Tachyons?</h2><p>At its most basic, Tachyons is a bunch of tiny utility classes that map to CSS properties that can be chained together to create design. You might be tempted to think of Tachyons as a CSS framework but it’s not really. There aren’t any nav bars or default button styles or other design decisions to pollute your blank canvas. Instead, it’s built around a scale that governs type size and measurements for padding, margins, and other properties where size comes into play. For instance, if you wanted to make a big, bold, blue headline, it might look like this:</p><div class=\"language-html highlighter-rouge\"><pre class=\"highlight\"><code><span class=\"nt\">&lt;h1</span> <span class=\"na\">class=</span><span class=\"s\">\"f2 b blue”&gt;Hello Tachyons!&lt;/h1&gt;</span></code></pre></div><p>Tachyons also elegantly handles responsive design with breakpoints for “not small,” “medium,” and “large.” So if we wanted our headline to be responsive, it might look like this:</p><div class=\"language-html highlighter-rouge\"><pre class=\"highlight\"><code><span class=\"nt\">&lt;h1</span> <span class=\"na\">class=</span><span class=\"s\">\"f3 f2-m f1-l b blue”&gt;Hello Tachyons!&lt;/h1&gt;</span></code></pre></div><p>If you’re interested in learning more about Tachyons’ technical qualities or how to use it, you should read the <a href=\"http://tachyons.io/docs/\">documentation</a> or, if you’re looking for examples of Tachyons in action, you can view the source code for a few of the sites we’ve built with it: <a href=\"https://shubox.io\">Shubox</a> and <a href=\"https://foredesign.co\">Fore Design</a>.</p><p>For now, I want to focus on the tangible benefits Amy and I have experienced as a design team.</p><h2 id=\"velocity\">Velocity</h2><p>Not long after experimenting with Tachyons, it became clear that semantics were holding us back from making design decisions and quickly iterating in the browser. Not only did we have to make the actual design decision, but then we needed to figure out what to call it, how to structure it, make sure there weren’t any naming conflicts, etc.</p><p>With Tachyons’ functional approach, we didn’t need to worry about what to call different elements. We could design in a much more fluid way because we were making the majority of our design notation in HTML, therefore writing way less CSS and switching contexts less often.</p><h2 id=\"stability\">Stability</h2><p>You might be thinking, “What if I want all my headlines to be a different color? Won’t I need to go back and change all those classes?” Yes, you will, and that can be a substantial effort if you’re making a change late in the process, however; if you’ve worked on any code base of sufficient size, you’ll know the feeling of dread of understanding the code, let alone deleting or making a significant change. The fear of unexpected consequences either becomes paralyzing or leads to bloated CSS.</p><p>With Tachyons, we felt like we were given the license to experiment, evolve our design systems, and make granular design decisions. Finding and replacing classes doesn’t seem like a bad compromise when you’re gaining creative flexibility along with stability in your code. There’s a liberation to knowing that your site will never appear to be broken to the end user and, because there’s a predesigned scale, nothing will ever look truly out-of-whack even if it doesn’t adhere to your style guide 100 percent.</p><h2 id=\"efficiency\">Efficiency</h2><p>For us, Tachyons eased the transition from design software to code editor so much so that we’ve completely cut making comps out of our process.</p><p>One big, albeit unsurprising, benefit from working directly in the medium of the web is that we’ve been able to experiment and push our design and technical boundaries further — with much less time and effort.</p><p>I’d love to hear whether anyone is using Tachyons currently and what your experience has been like. And if you haven’t tried it yet, I’d love to know if you do.</p>",
            "url": "https://perrera.com/2017/designing-with-tachyons/",
            
            
            
            
            
            "date_published": "2017-06-16T00:00:00+00:00",
            "date_modified": "2017-06-16T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2017/redesign-2017/",
            "title": "Redesign 2017",
            "summary": null,
            "content_text": "It’s easy to understand why people like animation. We&#8217;re instinctually attracted to motion but I’ve always drawn a fairly hard line when it comes to including it in web design: use it as little as possible. Not because I don’t think it’s interesting, but because I believe that if it isn’t purposeful, it undermines, rather than supports, a viewer&#8217;s ability to read and absorb the content of a site.That said, there is something undeniably cool about interface animation — especially when it&#8217;s used to help viewers understand a transition within or between pages — so I wanted to experiment with some of these effects.Since this website is content focused and rarely updated (a situation that I aim to change), it seemed like the perfect test case. For this redesign, I attempted to challenge some of my own assumptions about animation and content presentation while still producing a great reading experience.Behind the ScenesI chose ATC Arquette set in medium for headlines and regular weight for body copy because of its beautiful forms at large sizes and legibility at small sizes. It&#8217;s like a mashup of all the best features of Gotham and Circular (Fore Design&#8217;s brand typeface), down to the round dot on the lowercase &#8216;i&#8217;.Roboto Mono lends a more technical feel and complements Arquette nicely as a supporting face.I’ve moved the website from Craft to Jekyll since I had a delightful time working with it on the recent Fore Design and Shubox redesigns. Working with a static site generator feels faster, more direct, and less complicated since there are far fewer moving pieces compared with dynamic systems (which, frankly, are overkill for this project).In the tradition of progressive enhancement, it was important to me that the site still function without JavaScript so, instead of using a full front-end framework to integrate animation into the interface, I chose to pair two purpose-built JavaScript libraries to make silky-smooth page transitions. Anime is a lightweight animation engine and Barba overrides typical link behavior, instead injecting the requested data into the current page.ResultsAn interesting benefit of this experiment was improved performance: initial page load is snappy since there are no calls to a database. Plus, the perceived performance of subsequent page loads is even better thanks to both Barba’s incremental page loading strategy and to Netlify, a hosting platform with a built-in content delivery network.I had a lot of fun stretching my legs on this project and I’d love to hear what you think.",
            "content_html": "<p>It’s easy to understand why people like animation. We&#8217;re instinctually attracted to motion but I’ve always drawn a fairly hard line when it comes to including it in web design: use it as little as possible. Not because I don’t think it’s interesting, but because I believe that if it isn’t purposeful, it undermines, rather than supports, a viewer&#8217;s ability to read and absorb the content of a site.</p><p>That said, there <em>is</em> something undeniably cool about interface animation — especially when it&#8217;s used to help viewers understand a transition within or between pages — so I wanted to experiment with some of these effects.</p><p>Since this website is content focused and rarely updated (a situation that I aim to change), it seemed like the perfect test case. For this redesign, I attempted to challenge some of my own assumptions about animation and content presentation while still producing a great reading experience.</p><h2 id=\"behind-the-scenes\">Behind the Scenes</h2><p>I chose <a href=\"https://avondaletypeco.com/fonts/atc-arquette/\">ATC Arquette</a> set in medium for headlines and regular weight for body copy because of its beautiful forms at large sizes and legibility at small sizes. It&#8217;s like a mashup of all the best features of Gotham and Circular (Fore Design&#8217;s brand typeface), down to the round dot on the lowercase &#8216;i&#8217;.</p><p><a href=\"https://fonts.google.com/specimen/Roboto+Mono\">Roboto Mono</a> lends a more technical feel and complements Arquette nicely as a supporting face.</p><p><img src=\"/assets/redesign2017-typography-letter.svg\" alt=\"Article\" /><img src=\"/assets/redesign2017-article.jpg\" alt=\"Article\" /></p><p>I’ve moved the website from <a href=\"https://craftcms.com\">Craft</a> to <a href=\"https://jekyllrb.com\">Jekyll</a> since I had a delightful time working with it on the recent <a href=\"https://foredesign.co\">Fore Design</a> and <a href=\"https://shubox.io\">Shubox</a> redesigns. Working with a static site generator feels faster, more direct, and less complicated since there are far fewer moving pieces compared with dynamic systems (which, frankly, are overkill for this project).</p><p>In the tradition of <a href=\"https://en.wikipedia.org/wiki/Progressive_enhancement\">progressive enhancement</a>, it was important to me that the site still function without JavaScript so, instead of using a full front-end framework to integrate animation into the interface, I chose to pair two purpose-built JavaScript libraries to make silky-smooth page transitions. <a href=\"http://animejs.com\">Anime</a> is a lightweight animation engine and <a href=\"http://barbajs.org\">Barba</a> overrides typical link behavior, instead injecting the requested data into the current page.</p><h2 id=\"results\">Results</h2><p>An interesting benefit of this experiment was improved performance: initial page load is snappy since there are no calls to a database. Plus, the perceived performance of subsequent page loads is even better thanks to both Barba’s incremental page loading strategy and to <a href=\"https://www.netlify.com/\">Netlify</a>, a hosting platform with a built-in content delivery network.</p><p><img src=\"/assets/redesign2017-mobile.jpg\" alt=\"Mobile\" /><img src=\"/assets/redesign2017-home.jpg\" alt=\"Table of Contents\" /></p><p>I had a lot of fun stretching my legs on this project and I’d love to <a href=\"mailto:dan@perrera.com\">hear what you think</a>.</p>",
            "url": "https://perrera.com/2017/redesign-2017/",
            
            
            
            
            
            "date_published": "2017-06-06T00:00:00+00:00",
            "date_modified": "2017-06-06T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2016/2016-recap/",
            "title": "2016 Recap",
            "summary": null,
            "content_text": "I think we can all agree that 2016 was kind of a wacky year geopolitically but, at least for me, it was a good one personally and professionally.Fore Design Turns TwoIn the second full year of our consultancy, Amy and I were fortunate to work with a host of interesting companies and organizations. Two highlights were a new brand and website for Grove, makers of an ingenious indoor garden, and a commissioned infographic for The High Line, a truly inspiring public space in New York City.Red Sox ScoresWe also took on our first company project that mixed our two loves, design and baseball. The concept was simple: for every Red Sox game of the 2016 season, we visualized the final score. Scores had to be posted before the first pitch of the next game and include, at a minimum, the date of the game and the final score.We shared our work on Dribbble, a “show and tell” community for designers, and successfully designed scores for 165 games — rigorous but rewarding. To celebrate our achievement, we self-published a limited edition book of the project.Food EvolutionAt the end of 2015, I was inspired by the odd combination of The Great British Baking Show and the fantastic food documentary Cooked to cut preservatives and processed food out of my diet. Amy has happily joined me in this effort and together, we&#8217;ve turned the kitchen into a secondary creative outlet for us.By focusing on “real food” and scrutinizing the labels of packaged foods, we have slowly evolved our diet into something that is unrecognizable from a year ago. While building this healthy habit, ten pounds have melted off and I’m happy to say that I’m the lightest I’ve been in my adult life. That wasn&#8217;t actually the goal but is a nice indicator that we’re on the right track.I think it’s especially important to note that we haven’t restrained ourselves from our favorite foods. Pizza, tacos, pasta, pad thai, chocolate, and ice cream are all integrated into our diet. The big difference is that anything we can reasonably make at home — like pizza dough or teriyaki sauce — we do, and anything we buy can’t be laden with preservatives or things we wouldn&#8217;t normally have in our pantry. These constraints naturally led us to using better quality ingredients and we&#8217;ve maintained a more diverse diet that includes way more fruits and vegetables. Challenging our preconceived notions of food has been an unbelievably enlightening experience for both of us and I can&#8217;t recommend it enough. (If you&#8217;re interested, Michael Pollen&#8217;s In Defense of Food is a great place to start.)The big take away this year for me has been embracing constraints. Design and food are great examples but despite the topic, there is great opportunity for creativity within reasonable bounds.",
            "content_html": "<p>I think we can all agree that 2016 was kind of a wacky year geopolitically but, at least for me, it was a good one personally and professionally.</p><h2 id=\"fore-design-turns-two\">Fore Design Turns Two</h2><p>In the second full year of our consultancy, Amy and I were fortunate to work with a host of interesting companies and organizations. Two highlights were a <a href=\"https://foredesign.co/projects/grove\">new brand and website for Grove</a>, makers of an ingenious indoor garden, and a <a href=\"https://foredesign.co/projects/the-high-line\">commissioned infographic for The High Line</a>, a truly inspiring public space in New York City.</p><h2 id=\"red-sox-scores\">Red Sox Scores</h2><p>We also took on our first company project that mixed our two loves, design and baseball. The concept was simple: for every Red Sox game of the 2016 season, we visualized the final score. Scores had to be posted before the first pitch of the next game and include, at a minimum, the date of the game and the final score.</p><p>We <a href=\"https://dribbble.com/foredesign/projects/368526-Red-Sox-Scores-2016\">shared our work on Dribbble</a>, a “show and tell” community for designers, and successfully designed scores for 165 games — rigorous but rewarding. To celebrate our achievement, we self-published a <a href=\"https://soxscores.foredesign.co\">limited edition book of the project</a>.</p><h2 id=\"food-evolution\">Food Evolution</h2><p>At the end of 2015, I was inspired by the odd combination of <em>The Great British Baking Show</em> and the fantastic food documentary <em><a href=\"https://www.netflix.com/title/80022456\">Cooked</a></em> to cut preservatives and processed food out of my diet. Amy has happily joined me in this effort and together, we&#8217;ve turned the kitchen into a secondary creative outlet for us.</p><p>By focusing on “real food” and scrutinizing the labels of packaged foods, we have slowly evolved our diet into something that is unrecognizable from a year ago. While building this healthy habit, ten pounds have melted off and I’m happy to say that I’m the lightest I’ve been in my adult life. That wasn&#8217;t actually the goal but is a nice indicator that we’re on the right track.</p><p>I think it’s especially important to note that we haven’t restrained ourselves from our favorite foods. Pizza, tacos, pasta, pad thai, chocolate, and ice cream are all integrated into our diet. The big difference is that anything we can reasonably make at home — like pizza dough or teriyaki sauce — we do, and anything we buy can’t be laden with preservatives or things we wouldn&#8217;t normally have in our pantry. These constraints naturally led us to using better quality ingredients and we&#8217;ve maintained a more diverse diet that includes way more fruits and vegetables. Challenging our preconceived notions of food has been an unbelievably enlightening experience for both of us and I can&#8217;t recommend it enough. (If you&#8217;re interested, Michael Pollen&#8217;s <em><a href=\"https://www.amazon.com/Defense-Food-Eaters-Manifesto/dp/0143114964\">In Defense of Food</a></em> is a great place to start.)</p><p>The big take away this year for me has been embracing constraints. Design and food are great examples but despite the topic, there is great opportunity for creativity within reasonable bounds.</p>",
            "url": "https://perrera.com/2016/2016-recap/",
            
            
            
            
            
            "date_published": "2016-12-31T00:00:00+00:00",
            "date_modified": "2016-12-31T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2016/red-sox-scores-2016/",
            "title": "Red Sox Scores 2016",
            "summary": null,
            "content_text": "On Sunday the Red Sox wrapped up the their 2016 regular season. Amy and I, as Fore Design, have followed the season and made data visualizations for every game (162 in all) and have been posting our work on Dribbble. Starting with their 800 x 600 pixel size constraint, we made two rules: scores must be posted before the first pitch of the next game and must include, at a minimum, the date of the game and the final score.Our aim was to explore the intersection of our two favorite things — design and baseball — and it turned into an exciting challenge to produce compelling visualizations out of data that was largely the same from day-to-day. We knew at the outset that this project would be a tough given the length of the season — and were reminded of it every time we told someone about it.It took a few weeks to find a balance between our client work and producing something everyday that we could be proud of. We learned to schedule around day games, follow our instincts, and resolve ideas quickly.Looking back over the course of the season, it’s fun to observe recurring ideas, inspirations, style trends, and the evolution of our work. We explored simple shapes, line drawings, complex graphs, evocative illustrations, typography, and more. It’s amazing to see how much breadth we achieved.While it’s easy to view projects like this as a distraction, taking a break from our everyday projects to work on this was immeasurably beneficial. It sharpened our skills, honed our thinking, and will inform our work going forward.Dribbble was the perfect venue for this project. The community really encouraged us along the way and the positive feedback we received helped us stay energized throughout the season.As the Red Sox are headed to the post season, so is our project! We hope you follow along.",
            "content_html": "<p>On Sunday the Red Sox wrapped up the their 2016 regular season. Amy and I, as <a href=\"https://foredesign.co\">Fore Design</a>, have followed the season and made data visualizations for every game (162 in all) and have been <a href=\"https://dribbble.com/foredesign/projects/368526-Red-Sox-Scores-2016\">posting our work on Dribbble</a>. Starting with their 800 x 600 pixel size constraint, we made two rules: scores must be posted before the first pitch of the next game and must include, at a minimum, the date of the game and the final score.</p><p><img src=\"/assets/ss-cover.jpg\" alt=\"Sox Scores 2016\" /></p><p>Our aim was to explore the intersection of our two favorite things — design and baseball — and it turned into an exciting challenge to produce compelling visualizations out of data that was largely the same from day-to-day. We knew at the outset that this project would be a tough given the length of the season — and were reminded of it every time we told someone about it.</p><p>It took a few weeks to find a balance between our client work and producing something everyday that we could be proud of. We learned to schedule around day games, follow our instincts, and resolve ideas quickly.</p><p>Looking back over the course of the season, it’s fun to observe recurring ideas, inspirations, style trends, and the evolution of our work. We explored simple shapes, line drawings, complex graphs, evocative illustrations, typography, and more. It’s amazing to see how much breadth we achieved.</p><p><a href=\"https://dribbble.com/shots/2727788-Red-Sox-Scores-May-18-2016\"><img src=\"/assets/ss-0518.jpg\" alt=\"May 18, 2016\" /></a></p><p><a href=\"https://dribbble.com/shots/2766141-Red-Sox-Scores-June-7-2016\"><img src=\"/assets/ss-0615.jpg\" alt=\"June 7, 2016\" /></a></p><p><a href=\"https://dribbble.com/shots/2707128-Red-Sox-Scores-May-10-2016\"><img src=\"/assets/ss-0510.jpg\" alt=\"May 10, 2016\" /></a></p><p><a href=\"https://dribbble.com/shots/2900389-Red-Sox-Scores-August-14-2016\"><img src=\"/assets/ss-0814.jpg\" alt=\"August 14, 2016\" /></a></p><p>While it’s easy to view projects like this as a distraction, taking a break from our everyday projects to work on this was immeasurably beneficial. It sharpened our skills, honed our thinking, and will inform our work going forward.</p><p>Dribbble was the perfect venue for this project. The community really encouraged us along the way and the positive feedback we received helped us stay energized throughout the season.</p><p>As the Red Sox are headed to the post season, so is our project! <a href=\"https://dribbble.com/foredesign/projects/368526-Red-Sox-Scores-2016\">We hope you follow along</a>.</p>",
            "url": "https://perrera.com/2016/red-sox-scores-2016/",
            
            
            
            
            
            "date_published": "2016-10-05T00:00:00+00:00",
            "date_modified": "2016-10-05T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2016/design-for-open-source/",
            "title": "Design for Open Source",
            "summary": null,
            "content_text": "Early this year, the fifth version of the popular open source framework, Ruby on Rails, was released and along with it, a new identity featuring a rearranged logo. The thing that caught my eye about this effort was that it included a thing I’ve never seen before in an open source project – a creative brief.  Rails shouldn’t feel slick. It should be warm, approachable, and welcoming. Rails is in a different place than it was in 2004. It isn&#8217;t courting cutting-edge early adopters so we can lay off the gradients. Rails is now for everyone and its site should reflect that.I’m not sure what exactly is cutting-edge about gradients but all-in-all, I’m impressed with the thought that was put into the brief. However, the caps-lock, tentacle-attack logo that resulted from the process, while remaining consistent with the project&#8217;s history, doesn’t fulfill the ideals of the brief.When feedback was solicited, I offered my help and was told how I could participate. After trying to clean up the current logo, I came to the conclusion that there were no minor tweaks that would bring the current design to a place where it would meet the stated goals, so the next best thing would be a redesign that paid homage to the original. I made this:Even though I had no expectation that this work would be accepted, I sent along a pull request with a brief pitch explaining how this design balanced the goals listed in the brief with the logo’s history. While the Rails team was very appreciative and cordial, the work was quickly rejected which, even without any expectations, was a bummer.This was just one experience but I’m sure there are many more like it. The open source process for design is often a complete disaster that creates a toxic environment for designers. An overabundance of personal opinion means that every design decision is turned into an undirected bake-off (which, frankly, is just as bad as those reviled crowd-sourcing design sites). It’s an uphill battle for a designer and, oftentimes, it’s just not worth the time and effort. This is a huge missed opportunity  for the open source community – well-considered identity systems can inspire interest, create engagement, and set the tone of how the project is run.As someone with a foot in both worlds, I don’t believe it has to be that way.A New IdeaWhat if — just like projects have a technical lead or small team in charge of their development direction  — there was an accompanying “creative” lead, for lack of a better term, appointed to direct the design process, set expectations, and handle contributions from non-developers (like content-strategists, writers, and designers) in the community?Perhaps it&#8217;s too idealistic but maybe this could be a new model for how open source projects are run. If this sounds interesting to you, get in touch. I’d love to work with some thoughtful developers on putting this new idea into action.",
            "content_html": "<p>Early this year, the fifth version of the popular open source framework, Ruby on Rails, was released and along with it, a <a href=\"http://weblog.rubyonrails.org/2016/1/19/new-rails-identity/\">new identity</a> featuring a rearranged logo. The thing that caught my eye about this effort was that it included a thing I’ve never seen before in an open source project – a creative brief.</p><blockquote>  <p>Rails shouldn’t feel slick. It should be warm, approachable, and welcoming. Rails is in a different place than it was in 2004. It isn&#8217;t courting cutting-edge early adopters so we can lay off the gradients. Rails is now for everyone and its site should reflect that.</p></blockquote><p>I’m not sure what exactly is cutting-edge about gradients but all-in-all, I’m impressed with the thought that was put into the brief. However, the caps-lock, tentacle-attack logo that resulted from the process, while remaining consistent with the project&#8217;s history, doesn’t fulfill the ideals of the brief.</p><p><img src=\"/assets/rails-logo-current.png\" alt=\"Rails Logo Current\" /></p><p><a href=\"https://twitter.com/rails/status/689480911432249345\">When feedback was solicited</a>, <a href=\"https://twitter.com/dperrera/status/689484992016056321\">I offered my help</a> and <a href=\"https://twitter.com/rails/status/689485750300110849\">was told how I could participate</a>. After trying to clean up the current logo, I came to the conclusion that there were no minor tweaks that would bring the current design to a place where it would meet the stated goals, so the next best thing would be a redesign that paid homage to the original. I made this:</p><p><img src=\"/assets/rails-logo-proposed.png\" alt=\"Rails Logo Proposed\" /></p><p>Even though I had no expectation that this work would be accepted, I sent along a <a href=\"https://github.com/rails/homepage/pull/19\">pull request</a> with a brief pitch explaining how this design balanced the goals listed in the brief with the logo’s history. While the Rails team was very appreciative and cordial, the work was quickly rejected which, even without any expectations, was a bummer.</p><p>This was just one experience but I’m sure there are many more like it. The open source process for design is often a <a href=\"https://github.com/nodejs/node/issues/37#issuecomment-65632787\">complete disaster</a> that creates a toxic environment for designers. An overabundance of personal opinion means that every design decision is turned into an undirected bake-off (which, frankly, is just as bad as those reviled crowd-sourcing design sites). It’s an uphill battle for a designer and, oftentimes, it’s just not worth the time and effort. This is a huge missed opportunity  for the open source community – well-considered identity systems can inspire interest, create engagement, and set the tone of how the project is run.</p><p>As someone with a foot in both worlds, I don’t believe it has to be that way.</p><h2 id=\"a-new-idea\">A New Idea</h2><p>What if — just like projects have a technical lead or small team in charge of their development direction  — there was an accompanying “creative” lead, for lack of a better term, appointed to direct the design process, set expectations, and handle contributions from non-developers (like content-strategists, writers, and designers) in the community?</p><p>Perhaps it&#8217;s too idealistic but maybe this could be a new model for how open source projects are run. If this sounds interesting to you, <a href=\"mailto:dan@perrera.com\">get in touch</a>. I’d love to work with some thoughtful developers on putting this new idea into action.</p>",
            "url": "https://perrera.com/2016/design-for-open-source/",
            
            
            
            
            
            "date_published": "2016-03-14T12:00:00+00:00",
            "date_modified": "2016-03-14T12:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2016/the-current-state-of-web-security/",
            "title": "The Current State of Web Security",
            "summary": null,
            "content_text": "If you&#8217;re interested in the basics of web security —and you should be — check out this fantastic interview with Anselm Hannemann on CSS Tricks. You&#8217;ll learn about how HTTPS can instantly prevent bad situations like this:  If you log in over HTTP to your backend, your credentials are sent in plaintext to the server. So, anyone who intercepts your WiFi or internet connection now has access to your CMS&#8230;Getting started with HTTPS has never been easier. Let&#8217;s Encrypt, while a bit complicated, will give you a free SSL/TLS certificate for your website. If you&#8217;re working with PHP, Laravel Forge has made it ridiculously easy to secure your server with Let&#8217;s Encrypt or other paid security certificates.",
            "content_html": "<p>If you&#8217;re interested in the basics of web security —and you should be — check out this fantastic interview with <a href=\"https://css-tricks.com/interview-web-security/\">Anselm Hannemann on CSS Tricks</a>. You&#8217;ll learn about how HTTPS can instantly prevent bad situations like this:</p><blockquote>  <p>If you log in over HTTP to your backend, your credentials are sent in plaintext to the server. So, anyone who intercepts your WiFi or internet connection now has access to your CMS&#8230;</p></blockquote><p>Getting started with HTTPS has never been easier. <a href=\"https://letsencrypt.org\">Let&#8217;s Encrypt</a>, while a bit complicated, will give you a free SSL/TLS certificate for your website. If you&#8217;re working with PHP, <a href=\"https://forge.laravel.com\">Laravel Forge</a> has made it <a href=\"https://laracasts.com/series/server-management-with-forge/episodes/12\">ridiculously easy</a> to secure your server with Let&#8217;s Encrypt or other paid security certificates.</p>",
            "url": "https://perrera.com/2016/the-current-state-of-web-security/",
            
            
            
            
            
            "date_published": "2016-01-20T00:00:00+00:00",
            "date_modified": "2016-01-20T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2016/apply-an-active-class-to-all-nav-items-with-craftcms/",
            "title": "Apply an 'active' Class to all Nav Items with CraftCMS",
            "summary": null,
            "content_text": "In any content managed website, the need always seems to arise for a structured content section that can handle multiple levels of navigation. On a recent project I wanted to apply an &#8220;active&#8221; class to every page in the current path to give visitors a better sense of where they are in the site. Before I reveal the solution, it&#8217;s worth understanding the basics of how the {% nav %} tag works and exploring some of the models that Craft supplies.The Craft {% nav %} TagCraft makes rendering structured navigation trivially easy with the {% nav %} tag, as we can see with this example from the documentation:{% set entries = craft.entries.section('pages') %}&lt;ul id=\"nav\"&gt;    {% nav entry in entries %}        &lt;li&gt;            &lt;a href=\"{{ entry.url }}\"&gt;{{ entry.title }}&lt;/a&gt;            {% ifchildren %}                &lt;ul&gt;                    {% children %}                &lt;/ul&gt;            {% endifchildren %}        &lt;/li&gt;    {% endnav %}&lt;/ul&gt;But looking at the {% children %} tag, you may have the urge to try to wrap markup around it or try to cajole it in another way but you won&#8217;t have any luck. What is that thing doing?! From the docs again:  When Craft gets to this tag, it will loop through the element’s children, applying the same template defined between your {% nav %} and {% endnav %} tags to those children.In other words: the {% children %} tag copies the markup inside the {% nav %} tag, including logic. So in the above example, the {% children %} tag would output something like this for each entry:&lt;li&gt;    &lt;a href=\"https://foredesign.co/projects/logos\"&gt;Logos&lt;/a&gt;&lt;/li&gt;So if we gave that li a class of active, every list item would have that class regardless of whether it was actually active or not. That won&#8217;t do.The next step is to write some logic — in this case, an if statement to figure out when we want to apply that class. What tools do we have at our disposal to figure out whether an entry is active or not? Our URL path is a good place to start: we have access to the entry slugs from the craft.entries model, it mirrors the structure of our navigation, and it changes to reflect what page our visitors navigate to. Our logic should sound something like this: &#8220;if an entry&#8217;s slug is in the URL path, then give it a class of active.&#8221;The next question is, how do we turn the URL path into something we can use? Craft comes to the rescue again with the craft.request model. Specifically, we&#8217;re after the segments property, which returns an array of path segments in the URL. That means we can take a URL that looks like this:https://foredesign.co/projects/logosand start working with it in our Craft template like this:{# Get the segments and store then in a variable #}{% set slugs = craft.request.segments %}{# Dump the variable to see what we have #}{{ dump(slugs) }}{# Returns: # array (size=2) #   0 =&gt; string 'projects' (length=8) #   1 =&gt; string 'logos' (length=5) #}So we have the slugs, now we just have to check if the entry slug for each navigation item is in our slugs array as we iterate in our {% nav %} tag. Maybe something like this:{% set entries = craft.entries.section('pages') %}{% set slugs = craft.request.segments %}&lt;ul id=\"nav\"&gt;    {% nav entry in entries %}        &lt;li{% if entry.slug in slugs %} class=\"active\"{% endif %}&gt;        &lt;a href=\"{{ entry.url }}\"&gt;{{ entry.title }}&lt;/a&gt;        {% ifchildren %}            &lt;ul&gt;                {% children %}            &lt;/ul&gt;        {% endifchildren %}        &lt;/li&gt;    {% endnav %}&lt;/ul&gt;We&#8217;re taking advantage of the Twig in operator to check if the current entry.slug is in the slugs array and if it is, we apply class=\"active\" to the li tag. This totally works! Now, since we&#8217;re probably going to want to use this bit of code more than once, we should turn it into a macro:{# ================================ # In your Macros file # _macros.twig # ================================ #}{% macro isActive(slug) %}    {% if slug in craft.request.segments %} class=\"active\"{% endif %}{% endmacro %}{# ================================ # In your template file # ================================ #}{% import \"_macros\" as macros %}&lt;ul id=\"nav\"&gt;    {% nav entry in entries %}        &lt;li{{ macros.isActive(entry.slug) }}&gt;            &lt;a href=\"{{ entry.url }}\"&gt;{{ entry.title }}&lt;/a&gt;            {% ifchildren %}                &lt;ul&gt;                    {% children %}                &lt;/ul&gt;            {% endifchildren %}        &lt;/li&gt;    {% endnav %}&lt;/ul&gt;You can see that we&#8217;ve created a macro that will accept a slug to test and will work through the logic while keeping our code tidy and reusable. Hopefully this small example opens up a world of possibilities for your next project.",
            "content_html": "<p>In any content managed website, the need always seems to arise for a structured content section that can handle multiple levels of navigation. On a recent project I wanted to apply an &#8220;active&#8221; class to every page in the current path to give visitors a better sense of where they are in the site. Before I reveal the solution, it&#8217;s worth understanding the basics of how the <code class=\"highlighter-rouge\"><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">nav</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span></code> tag works and exploring some of the models that Craft supplies.</p><h2 id=\"the-craft--nav--tag\">The Craft <code class=\"highlighter-rouge\"><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">nav</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span></code> Tag</h2><p>Craft makes rendering structured navigation trivially easy with the <a href=\"https://craftcms.com/docs/templating/nav\"><code class=\"highlighter-rouge\"><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">nav</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span></code> tag</a>, as we can see with this example from the documentation:</p><div class=\"language-twig highlighter-rouge\"><pre class=\"highlight\"><code><span class=\"cp\">{%</span> <span class=\"k\">set</span> <span class=\"nv\">entries</span> <span class=\"err\">=</span> <span class=\"nv\">craft.entries.section</span><span class=\"p\">(</span><span class=\"s1\">'pages'</span><span class=\"p\">)</span> <span class=\"cp\">%}</span><span class=\"nt\">&lt;ul</span> <span class=\"na\">id=</span><span class=\"s\">\"nav\"</span><span class=\"nt\">&gt;</span>    <span class=\"cp\">{%</span> <span class=\"nv\">nav</span> <span class=\"nv\">entry</span> <span class=\"ow\">in</span> <span class=\"nv\">entries</span> <span class=\"cp\">%}</span>        <span class=\"nt\">&lt;li&gt;</span>            <span class=\"nt\">&lt;a</span> <span class=\"na\">href=</span><span class=\"s\">\"</span><span class=\"cp\">{{</span> <span class=\"nv\">entry.url</span> <span class=\"cp\">}}</span><span class=\"s\">\"</span><span class=\"nt\">&gt;</span><span class=\"cp\">{{</span> <span class=\"nv\">entry.title</span> <span class=\"cp\">}}</span><span class=\"nt\">&lt;/a&gt;</span>            <span class=\"cp\">{%</span> <span class=\"nv\">ifchildren</span> <span class=\"cp\">%}</span>                <span class=\"nt\">&lt;ul&gt;</span>                    <span class=\"cp\">{%</span> <span class=\"nv\">children</span> <span class=\"cp\">%}</span>                <span class=\"nt\">&lt;/ul&gt;</span>            <span class=\"cp\">{%</span> <span class=\"nv\">endifchildren</span> <span class=\"cp\">%}</span>        <span class=\"nt\">&lt;/li&gt;</span>    <span class=\"cp\">{%</span> <span class=\"nv\">endnav</span> <span class=\"cp\">%}</span><span class=\"nt\">&lt;/ul&gt;</span></code></pre></div><p>But looking at the <code class=\"highlighter-rouge\"><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">children</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span></code> tag, you may have the urge to try to wrap markup around it or try to cajole it in another way but you won&#8217;t have any luck. What is that thing doing?! From the docs again:</p><blockquote>  <p>When Craft gets to this tag, it will loop through the element’s children, applying the same template defined between your <code class=\"highlighter-rouge\"><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">nav</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span></code> and <code class=\"highlighter-rouge\"><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">endnav</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span></code> tags to those children.</p></blockquote><p>In other words: the <code class=\"highlighter-rouge\"><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">children</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span></code> tag copies the markup inside the <code class=\"highlighter-rouge\"><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">nav</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span></code> tag, including logic. So in the above example, the <code class=\"highlighter-rouge\"><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">children</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span></code> tag would output something like this for each entry:</p><div class=\"highlighter-rouge\"><pre class=\"highlight\"><code>&lt;li&gt;    &lt;a href=\"https://foredesign.co/projects/logos\"&gt;Logos&lt;/a&gt;&lt;/li&gt;</code></pre></div><p>So if we gave that <code class=\"highlighter-rouge\">li</code> a class of active, every list item would have that class regardless of whether it was <em>actually</em> active or not. That won&#8217;t do.</p><p>The next step is to write some logic — in this case, an <code class=\"highlighter-rouge\">if</code> statement to figure out when we want to apply that class. What tools do we have at our disposal to figure out whether an entry is active or not? Our URL path is a good place to start: we have access to the entry slugs from the <a href=\"https://craftcms.com/docs/templating/craft.entries\"><code class=\"highlighter-rouge\">craft.entries</code> model</a>, it mirrors the structure of our navigation, and it changes to reflect what page our visitors navigate to. Our logic should sound something like this: &#8220;if an entry&#8217;s slug is in the URL path, then give it a class of active.&#8221;</p><p>The next question is, how do we turn the URL path into something we can use? Craft comes to the rescue again with the <a href=\"https://craftcms.com/docs/templating/craft.request\"><code class=\"highlighter-rouge\">craft.request</code> model</a>. Specifically, we&#8217;re after the <code class=\"highlighter-rouge\">segments</code> property, which returns an array of path segments in the URL. That means we can take a URL that looks like this:</p><p><code class=\"highlighter-rouge\">https://foredesign.co/projects/logos</code></p><p>and start working with it in our Craft template like this:</p><div class=\"highlighter-rouge\"><pre class=\"highlight\"><code><span class=\"p\">{</span><span class=\"err\">#</span><span class=\"w\"> </span><span class=\"err\">Get</span><span class=\"w\"> </span><span class=\"err\">the</span><span class=\"w\"> </span><span class=\"err\">segments</span><span class=\"w\"> </span><span class=\"err\">and</span><span class=\"w\"> </span><span class=\"err\">store</span><span class=\"w\"> </span><span class=\"err\">then</span><span class=\"w\"> </span><span class=\"err\">in</span><span class=\"w\"> </span><span class=\"err\">a</span><span class=\"w\"> </span><span class=\"err\">variable</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"p\">}</span><span class=\"w\"></span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">set</span><span class=\"w\"> </span><span class=\"err\">slugs</span><span class=\"w\"> </span><span class=\"err\">=</span><span class=\"w\"> </span><span class=\"err\">craft.request.segments</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\"></span><span class=\"p\">{</span><span class=\"err\">#</span><span class=\"w\"> </span><span class=\"err\">Dump</span><span class=\"w\"> </span><span class=\"err\">the</span><span class=\"w\"> </span><span class=\"err\">variable</span><span class=\"w\"> </span><span class=\"err\">to</span><span class=\"w\"> </span><span class=\"err\">see</span><span class=\"w\"> </span><span class=\"err\">what</span><span class=\"w\"> </span><span class=\"err\">we</span><span class=\"w\"> </span><span class=\"err\">have</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"p\">}</span><span class=\"w\"></span><span class=\"p\">{</span><span class=\"err\">{</span><span class=\"w\"> </span><span class=\"err\">dump(slugs)</span><span class=\"w\"> </span><span class=\"p\">}</span><span class=\"err\">}</span><span class=\"w\"></span><span class=\"p\">{</span><span class=\"err\">#</span><span class=\"w\"> </span><span class=\"err\">Returns:</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"w\"> </span><span class=\"err\">array</span><span class=\"w\"> </span><span class=\"err\">(size=2)</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"w\">   </span><span class=\"err\">0</span><span class=\"w\"> </span><span class=\"err\">=&gt;</span><span class=\"w\"> </span><span class=\"err\">string</span><span class=\"w\"> </span><span class=\"err\">'projects'</span><span class=\"w\"> </span><span class=\"err\">(length=8)</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"w\">   </span><span class=\"err\">1</span><span class=\"w\"> </span><span class=\"err\">=&gt;</span><span class=\"w\"> </span><span class=\"err\">string</span><span class=\"w\"> </span><span class=\"err\">'logos'</span><span class=\"w\"> </span><span class=\"err\">(length=5)</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"p\">}</span><span class=\"w\"></span></code></pre></div><p>So we have the slugs, now we just have to check if the entry slug for each navigation item is in our <code class=\"highlighter-rouge\">slugs</code> array as we iterate in our <code class=\"highlighter-rouge\"><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">nav</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span></code> tag. Maybe something like this:</p><div class=\"highlighter-rouge\"><pre class=\"highlight\"><code><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">set</span><span class=\"w\"> </span><span class=\"err\">entries</span><span class=\"w\"> </span><span class=\"err\">=</span><span class=\"w\"> </span><span class=\"err\">craft.entries.section('pages')</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\"></span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">set</span><span class=\"w\"> </span><span class=\"err\">slugs</span><span class=\"w\"> </span><span class=\"err\">=</span><span class=\"w\"> </span><span class=\"err\">craft.request.segments</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\"></span><span class=\"err\">&lt;ul</span><span class=\"w\"> </span><span class=\"err\">id=</span><span class=\"s2\">\"nav\"</span><span class=\"err\">&gt;</span><span class=\"w\">    </span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">nav</span><span class=\"w\"> </span><span class=\"err\">entry</span><span class=\"w\"> </span><span class=\"err\">in</span><span class=\"w\"> </span><span class=\"err\">entries</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\">        </span><span class=\"err\">&lt;li</span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">if</span><span class=\"w\"> </span><span class=\"err\">entry.slug</span><span class=\"w\"> </span><span class=\"err\">in</span><span class=\"w\"> </span><span class=\"err\">slugs</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\"> </span><span class=\"err\">class=</span><span class=\"s2\">\"active\"</span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">endif</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"err\">&gt;</span><span class=\"w\">        </span><span class=\"err\">&lt;a</span><span class=\"w\"> </span><span class=\"err\">href=</span><span class=\"s2\">\"{{ entry.url }}\"</span><span class=\"err\">&gt;</span><span class=\"p\">{</span><span class=\"err\">{</span><span class=\"w\"> </span><span class=\"err\">entry.title</span><span class=\"w\"> </span><span class=\"p\">}</span><span class=\"err\">}&lt;/a&gt;</span><span class=\"w\">        </span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">ifchildren</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\">            </span><span class=\"err\">&lt;ul&gt;</span><span class=\"w\">                </span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">children</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\">            </span><span class=\"err\">&lt;/ul&gt;</span><span class=\"w\">        </span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">endifchildren</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\">        </span><span class=\"err\">&lt;/li&gt;</span><span class=\"w\">    </span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">endnav</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\"></span><span class=\"err\">&lt;/ul&gt;</span><span class=\"w\"></span></code></pre></div><p>We&#8217;re taking advantage of the Twig <a href=\"http://twig.sensiolabs.org/doc/templates.html#containment-operator\"><code class=\"highlighter-rouge\">in</code> operator</a> to check if the current <code class=\"highlighter-rouge\">entry.slug</code> is in the <code class=\"highlighter-rouge\">slugs</code> array and if it is, we apply <code class=\"highlighter-rouge\">class=\"active\"</code> to the <code class=\"highlighter-rouge\">li</code> tag. This totally works! Now, since we&#8217;re probably going to want to use this bit of code more than once, we should turn it into a macro:</p><div class=\"highlighter-rouge\"><pre class=\"highlight\"><code><span class=\"p\">{</span><span class=\"err\">#</span><span class=\"w\"> </span><span class=\"err\">================================</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"w\"> </span><span class=\"err\">In</span><span class=\"w\"> </span><span class=\"err\">your</span><span class=\"w\"> </span><span class=\"err\">Macros</span><span class=\"w\"> </span><span class=\"err\">file</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"w\"> </span><span class=\"err\">_macros.twig</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"w\"> </span><span class=\"err\">================================</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"p\">}</span><span class=\"w\"></span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">macro</span><span class=\"w\"> </span><span class=\"err\">isActive(slug)</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\">    </span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">if</span><span class=\"w\"> </span><span class=\"err\">slug</span><span class=\"w\"> </span><span class=\"err\">in</span><span class=\"w\"> </span><span class=\"err\">craft.request.segments</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\"> </span><span class=\"err\">class=</span><span class=\"s2\">\"active\"</span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">endif</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\"></span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">endmacro</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\"></span><span class=\"p\">{</span><span class=\"err\">#</span><span class=\"w\"> </span><span class=\"err\">================================</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"w\"> </span><span class=\"err\">In</span><span class=\"w\"> </span><span class=\"err\">your</span><span class=\"w\"> </span><span class=\"err\">template</span><span class=\"w\"> </span><span class=\"err\">file</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"w\"> </span><span class=\"err\">================================</span><span class=\"w\"> </span><span class=\"err\">#</span><span class=\"p\">}</span><span class=\"w\"></span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">import</span><span class=\"w\"> </span><span class=\"nt\">\"_macros\"</span><span class=\"w\"> </span><span class=\"err\">as</span><span class=\"w\"> </span><span class=\"err\">macros</span><span class=\"w\"> </span><span class=\"err\">%}</span><span class=\"w\"></span><span class=\"err\">&lt;ul</span><span class=\"w\"> </span><span class=\"err\">id=</span><span class=\"s2\">\"nav\"</span><span class=\"err\">&gt;</span><span class=\"w\">    </span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">nav</span><span class=\"w\"> </span><span class=\"err\">entry</span><span class=\"w\"> </span><span class=\"err\">in</span><span class=\"w\"> </span><span class=\"err\">entries</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\">        </span><span class=\"err\">&lt;li</span><span class=\"p\">{</span><span class=\"err\">{</span><span class=\"w\"> </span><span class=\"err\">macros.isActive(entry.slug)</span><span class=\"w\"> </span><span class=\"p\">}</span><span class=\"err\">}&gt;</span><span class=\"w\">            </span><span class=\"err\">&lt;a</span><span class=\"w\"> </span><span class=\"err\">href=</span><span class=\"s2\">\"{{ entry.url }}\"</span><span class=\"err\">&gt;</span><span class=\"p\">{</span><span class=\"err\">{</span><span class=\"w\"> </span><span class=\"err\">entry.title</span><span class=\"w\"> </span><span class=\"p\">}</span><span class=\"err\">}&lt;/a&gt;</span><span class=\"w\">            </span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">ifchildren</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\">                </span><span class=\"err\">&lt;ul&gt;</span><span class=\"w\">                    </span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">children</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\">                </span><span class=\"err\">&lt;/ul&gt;</span><span class=\"w\">            </span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">endifchildren</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\">        </span><span class=\"err\">&lt;/li&gt;</span><span class=\"w\">    </span><span class=\"p\">{</span><span class=\"err\">%</span><span class=\"w\"> </span><span class=\"err\">endnav</span><span class=\"w\"> </span><span class=\"err\">%</span><span class=\"p\">}</span><span class=\"w\"></span><span class=\"err\">&lt;/ul&gt;</span><span class=\"w\"></span></code></pre></div><p>You can see that we&#8217;ve created a macro that will accept a slug to test and will work through the logic while keeping our code tidy and reusable. Hopefully this small example opens up a world of possibilities for your next project.</p>",
            "url": "https://perrera.com/2016/apply-an-active-class-to-all-nav-items-with-craftcms/",
            
            
            
            
            
            "date_published": "2016-01-18T00:00:00+00:00",
            "date_modified": "2016-01-18T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2015/2015-recap/",
            "title": "2015 Recap",
            "summary": null,
            "content_text": "A Little SabbaticalAmy and I spent the first half of this year taking a break from client work to rediscover our love of art and design, read, learn, cook, bake, and work on some personal projects. We also rebranded Fore Design, completely revamped our design process, found our voice, and built a business and lifestyle that is true to ourselves.The benefits of our &#8220;little sabbatical&#8221; can&#8217;t be understated. Our attitude has returned to a happy, positive place, the energy has flooded back into our work — and it shows. We won our first design award, helped one of our clients more than double their fundraising efforts, and completed a handful of projects that not only meet our own high standards but were true to the people and companies we worked with.Work/life IntegrationI&#8217;ve always had an issue with what people call &#8220;work/life balance&#8221; because of its implication that the two are (or should be) entirely separate. Instead, Amy and I have attached ourselves to the idea of &#8220;work/life integration.&#8221; The pace of this way of living is far more sensitive to the natural ebb and flow of creative work, making every aspect of work and life more enjoyable. And with the help of a dedicated home office space, we&#8217;ve been able to weave work and life together in way that supports reflection and creativity.Healthy improvementsWe typically start every day with a long walk on the trail by our condo with our dog, and have turned cooking from a necessity into another creative space where we can experiment and create away from the computer. We&#8217;ve made gradual improvements to our diet by removing preservatives and being more thoughtful about the process of how food finds our plate. Now I bake all our bread and Amy makes granola bars for breakfast (which she&#8217;s elevated into breakfast art).Daily LearningI&#8217;ve personally spent a lot of time focusing on development and have made learning a part of my daily routine. I&#8217;ve become fluent in JavaScript, learned how to manage my own servers, and strengthened my technical skill set — but it&#8217;s all been in the service of design.For me, the story of 2015 ends on a high note. My big takeaway from 2015 can be summed up in one thought: Design is in everything and everything can be designed.",
            "content_html": "<h2 id=\"a-little-sabbatical\">A Little Sabbatical</h2><p>Amy and I spent the first half of this year taking a break from client work to rediscover our love of <a href=\"https://foredesign.co/journal/2015/catnip-mouse\">art</a> and design, <a href=\"https://foredesign.co/journal/2015/design-books\">read</a>, learn, cook, bake, and work on some personal projects. We also rebranded <a href=\"https://foredesign.co\">Fore Design</a>, completely revamped our design process, found our voice, and built a business and lifestyle that is true to ourselves.</p><p>The benefits of our &#8220;little sabbatical&#8221; can&#8217;t be understated. Our attitude has returned to a happy, positive place, the energy has flooded back into our work — and it shows. We won our first design award, helped one of our clients more than double their fundraising efforts, and completed a handful of projects that not only meet our own high standards but were true to the people and companies we worked with.</p><h2 id=\"worklife-integration\">Work/life Integration</h2><p>I&#8217;ve always had an issue with what people call &#8220;work/life balance&#8221; because of its implication that the two are (or should be) entirely separate. Instead, Amy and I have attached ourselves to the idea of &#8220;work/life <em>integration</em>.&#8221; The pace of this way of living is far more sensitive to the natural ebb and flow of creative work, making every aspect of work and life more enjoyable. And with the help of a dedicated home office space, we&#8217;ve been able to weave work and life together in way that supports reflection and creativity.</p><h2 id=\"healthy-improvements\">Healthy improvements</h2><p>We typically start every day with a long walk on the trail by our condo with our dog, and have turned cooking from a necessity into another creative space where we can experiment and create away from the computer. We&#8217;ve made gradual improvements to our diet by removing preservatives and being more thoughtful about the process of how food finds our plate. Now I bake all our bread and Amy makes granola bars for breakfast (which she&#8217;s elevated into breakfast art).</p><h2 id=\"daily-learning\">Daily Learning</h2><p>I&#8217;ve personally spent a lot of time focusing on development and have made learning a part of my daily routine. I&#8217;ve become fluent in JavaScript, learned how to manage my own <a href=\"https://www.digitalocean.com/?refcode=dec1fc7d362e\">servers</a>, and strengthened my technical skill set — but it&#8217;s all been in the service of design.</p><p>For me, the story of 2015 ends on a high note. My big takeaway from 2015 can be summed up in one thought: <strong>Design is in everything and everything can be designed.</strong></p>",
            "url": "https://perrera.com/2015/2015-recap/",
            
            
            
            
            
            "date_published": "2015-12-31T00:00:00+00:00",
            "date_modified": "2015-12-31T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2015/clearing-safari-9s-pinned-tab-icon-cache/",
            "title": "Clearing Safari 9's Pinned Tab Icon Cache",
            "summary": null,
            "content_text": "The release of OS El Capitan brought us Safari 9, which gave web developers a slew of new features to play with. One of my favorite new features is the ability to define an icon for pinned tabs. Implementing these icons is a snap. All you need is an SVG icon (16px square works best) and a link tag in the head of your document to include it:&lt;link rel=\"mask-icon\" href=\"icon.svg\" color=\"#322f31\"&gt;While working on our company website I ran into a situation where the pinned tab got stuck on the default letter in a rounded square. No amount of cache clearing had any effect. However, one terminal command saved the day:rm ~/Library/Safari/Template\\ Icons/*",
            "content_html": "<p>The release of OS El Capitan brought us Safari 9, which gave web developers a <a href=\"https://developer.apple.com/library/prerelease/mac/releasenotes/General/WhatsNewInSafari/Articles/Safari_9.html\">slew of new features</a> to play with. One of my favorite new features is the ability to define an icon for pinned tabs. Implementing these icons is a snap. All you need is an SVG icon (16px square works best) and a link tag in the <code class=\"highlighter-rouge\">head</code> of your document to include it:</p><p><code class=\"highlighter-rouge\">&lt;link rel=\"mask-icon\" href=\"icon.svg\" color=\"#322f31\"&gt;</code></p><p>While working on our <a href=\"https://foredesign.co\">company website</a> I ran into a situation where the pinned tab got stuck on the default letter in a rounded square. No amount of cache clearing had any effect. However, one terminal command saved the day:</p><p><code class=\"highlighter-rouge\">rm ~/Library/Safari/Template\\ Icons/*</code></p>",
            "url": "https://perrera.com/2015/clearing-safari-9s-pinned-tab-icon-cache/",
            
            
            
            
            
            "date_published": "2015-11-09T00:00:00+00:00",
            "date_modified": "2015-11-09T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2015/what-is-original/",
            "title": "What is Original?",
            "summary": null,
            "content_text": "As a designer and fan of culture, I’ve always been intrigued by the question “What is original?” Sometimes it’s easy to spot a copy however, most times the lines of plagiarism, influence, and coincidence are – if you will – more blurred.This has taken a litigious turn in the realm of music this year with the notable conclusion of a trial that found that Robin Thicke and Pharrell Williams’ 2013 hit “Blurred Lines” infringed on the copyright of Marvin Gaye’s 1977 classic “Got to Give It Up.”Ben Sisario and Noah Smith write about the decision for the NY Times:  Nona and Frankie Gaye, two of Marvin Gaye’s children, are to receive $4 million in damages plus about $3.3 million of the profits earned by Mr. Thicke and Mr. Williams. The decision is believed to be one of the largest damages awards in a music copyright case.While, to my ears, “Blurred Lines” undoubtedly conjures up the funky vibe of “Got to Give It Up” and shares some similar sounds idiomatic of the 1970’s, the two are not the same. But with a $7.3 million dollar award in their pocket, Gaye’s estate must be licking their chops at the prospect of more litigation — Marvin Gaye’s cultural influence is one of the greatest in modern music.Even though the “Blurred Lines” case hadn’t concluded at this point, it might explain the out of court settlement that resulted in Tom Petty’s 12.5% writing credit and associated royalties on Sam Smith’s 2014 hit “Stay With Me,” based on similarities with Petty’s 1989 song “I Won’t Back Down.” Even though the songs share nothing but a similar cadence in the chorus, it’s cheaper and easier to give up a percentage of your work than to mount a legal defense and be found on the short end of a jury decision.It seems that current copyright and patent laws, despite their original intent, are becoming barriers to creativity while the tools to create are becoming more ubiquitous. What does this mean for people who want to add to our culture with art and technology?If you’re interested in exploring this topic further, start with the Ted Radio Hour on the subject then revisit the 2011 four-part series, Everything is a Remix. If you come across more material on the subject of originality, send it my way.",
            "content_html": "<p>As a designer and fan of culture, I’ve always been intrigued by the question “What is original?” Sometimes it’s easy to spot a copy however, most times the lines of plagiarism, influence, and coincidence are – if you will – more blurred.</p><p>This has taken a litigious turn in the realm of music this year with the notable conclusion of a trial that found that Robin Thicke and Pharrell Williams’ 2013 hit “<a href=\"https://youtu.be/yyDUC1LUXSU\">Blurred Lines</a>” infringed on the copyright of Marvin Gaye’s 1977 classic “<a href=\"https://youtu.be/fp7Q1OAzITM\">Got to Give It Up</a>.”</p><p><a href=\"http://www.nytimes.com/2015/03/11/business/media/blurred-lines-infringed-on-marvin-gaye-copyright-jury-rules.html\">Ben Sisario and Noah Smith write about the decision for the NY Times</a>:</p><blockquote>  <p>Nona and Frankie Gaye, two of Marvin Gaye’s children, are to receive $4 million in damages plus about $3.3 million of the profits earned by Mr. Thicke and Mr. Williams. The decision is believed to be one of the largest damages awards in a music copyright case.</p></blockquote><p>While, to my ears, “Blurred Lines” undoubtedly conjures up the funky vibe of “Got to Give It Up” and shares some similar sounds idiomatic of the 1970’s, the two are not the same. But with a $7.3 million dollar award in their pocket, Gaye’s estate must be licking their chops at the prospect of more litigation — Marvin Gaye’s cultural influence is one of the greatest in modern music.</p><p>Even though the “Blurred Lines” case hadn’t concluded at this point, it might explain the out of court settlement that resulted in Tom Petty’s <a href=\"http://consequenceofsound.net/2015/01/tom-petty-awarded-songwriting-royalties-for-sam-smiths-stay-with-me/\">12.5% writing credit and associated royalties</a> on Sam Smith’s 2014 hit “<a href=\"https://youtu.be/pB-5XG-DbAA\">Stay With Me</a>,” based on similarities with Petty’s 1989 song “<a href=\"https://youtu.be/nvlTJrNJ5lA\">I Won’t Back Down</a>.” Even though the songs share nothing but a similar cadence in the chorus, it’s cheaper and easier to give up a percentage of your work than to mount a legal defense and be found on the short end of a jury decision.</p><p>It seems that current copyright and patent laws, <a href=\"https://en.wikipedia.org/wiki/Copyright_law_of_the_United_States\">despite their original intent</a>, are becoming barriers to creativity while the tools to create are becoming more ubiquitous. What does this mean for people who want to add to our culture with art and technology?</p><p>If you’re interested in exploring this topic further, start with the <a href=\"http://www.npr.org/programs/ted-radio-hour/321797073/what-is-original\">Ted Radio Hour</a> on the subject then revisit the 2011 four-part series, <a href=\"http://everythingisaremix.info/watch-the-series/\">Everything is a Remix</a>. If you come across more material on the subject of originality, <a href=\"mailto:hello@perrera.com\">send it my way</a>.</p>",
            "url": "https://perrera.com/2015/what-is-original/",
            
            
            
            
            
            "date_published": "2015-03-23T00:00:00+00:00",
            "date_modified": "2015-03-23T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2015/shipit/",
            "title": "Shipit",
            "summary": null,
            "content_text": "As I’ve fallen deeper under the spell of JavaScript build tools for front-end development work, I’ve become really comfortable with automating all kinds of local development tasks, primarily with Gulp. It got me wondering how I might manage server environments and deployments in a similar way. Enter Shipit:  Shipit was built to be a Capistrano alternative for people who don&#8217;t know ruby, or who experienced some issues with it. If you want to write tasks in JavaScript and enjoy the node ecosystem, Shipit is also for you.  You can automate anything with Shipit but most of the time you will want to deploy your project using the Shipit deploy task.Shipit is exactly what I was looking for. I had the deploy task up in running in under 10 minutes and went on to create a slew of custom tasks to sync databases, download assets, and even update Craft all with a few terminal commands. It’s been a great addition to my toolbelt.",
            "content_html": "<p>As I’ve fallen deeper under the spell of JavaScript build tools for front-end development work, I’ve become really comfortable with automating all kinds of local development tasks, primarily with <a href=\"http://gulpjs.com\">Gulp</a>. It got me wondering how I might manage server environments and deployments in a similar way. Enter <a href=\"https://github.com/shipitjs/shipit\">Shipit</a>:</p><blockquote>  <p>Shipit was built to be a Capistrano alternative for people who don&#8217;t know ruby, or who experienced some issues with it. If you want to write tasks in JavaScript and enjoy the node ecosystem, Shipit is also for you.</p>  <p>You can automate anything with Shipit but most of the time you will want to deploy your project using the <a href=\"https://github.com/shipitjs/shipit-deploy\">Shipit deploy task</a>.</p></blockquote><p>Shipit is exactly what I was looking for. I had the deploy task up in running in under 10 minutes and went on to create a slew of custom tasks to sync databases, download assets, and even update <a href=\"http://buildwithcraft.com\">Craft</a> all with a few terminal commands. It’s been a great addition to my toolbelt.</p>",
            "url": "https://perrera.com/2015/shipit/",
            
            
            
            
            
            "date_published": "2015-03-18T00:00:00+00:00",
            "date_modified": "2015-03-18T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2014/2014-recap/",
            "title": "2014 Recap",
            "summary": null,
            "content_text": "2014 has been a year of extreme emotions for me. I’ve never felt more disappointed, angry, exhausted and completely befuddled. However, I’ve never been more excited, energized, happy or hopeful than I have in the last few months.After leaving The Outfit in September, Amy and I refocused our efforts and found our way back to the things we love most — designing, producing and, most importantly, working together. I reacquainted myself with front- and back-end development, began learning more about JavaScript, dove deeper into Craft, improved my workflow, and brought design back to the forefront. Amy worked on honing her design and illustration skills. I was so pleased to watch her fall back in love with drawing, hand-lettering and pattern making. We both took classes, spent loads of time at the MFA and practiced, practiced, practiced.In just the last two months, we formed Fore Design, Inc., launched a new website and blog, designed, produced, hand-addressed and sent handmade gifts to our clients, and set up an online shop. (We even had our first paying customer — Amy’s mom.)We’ve produced more work and accomplished more things in the last quarter and I couldn’t be prouder or more optimistic for the year ahead.",
            "content_html": "<p>2014 has been a year of extreme emotions for me. I’ve never felt more disappointed, angry, exhausted and completely befuddled. However, I’ve never been more excited, energized, happy or hopeful than I have in the last few months.</p><p>After leaving The Outfit in September, Amy and I refocused our efforts and found our way back to the things we love most — designing, producing and, most importantly, working together. I reacquainted myself with front- and back-end development, began learning more about JavaScript, dove deeper into <a href=\"http://buildwithcraft.com\">Craft</a>, improved my workflow, and brought design back to the forefront. Amy worked on honing her design and illustration skills. I was so pleased to watch her fall back in love with drawing, hand-lettering and pattern making. We both took classes, spent loads of time at the <a href=\"http://www.mfa.org\">MFA</a> and practiced, practiced, practiced.</p><p>In just the last two months, we formed <a href=\"https://foredesign.co\">Fore Design, Inc.</a>, launched a <a href=\"https://foredesign.co\">new website</a> and <a href=\"https://foredesign.co/journal\">blog</a>, designed, produced, hand-addressed and sent handmade gifts to our clients, and set up an <a href=\"https://foredesign.co/shop\">online shop</a>. (We even had our first paying customer — Amy’s mom.)</p><p>We’ve produced more work and accomplished more things in the last quarter and I couldn’t be prouder or more optimistic for the year ahead.</p>",
            "url": "https://perrera.com/2014/2014-recap/",
            
            
            
            
            
            "date_published": "2014-12-31T00:00:00+00:00",
            "date_modified": "2014-12-31T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2014/help-sublime-text-forget-last-open-files/",
            "title": "Help Sublime Text Forget Last Open Files",
            "summary": null,
            "content_text": "Let&#8217;s say you accidentally opened an entire directory or a file that makes Sublime Text crash or hang. No big deal, just force quit, right? There&#8217;s one small problem — unless you explicitly turned it off, Sublime wants to be helpful and open the last files you were working on. So you might find yourself in a situation where the app crashes or hangs every time you to try to open it.You&#8217;ve probably tried restarting the application, restarting your computer, and even reinstalling the app to no avail. Fortunately this is an easy fix. On your Mac, all you have to do is navigate to Library/Application Support/Sublime Text 3/Local and delete Session.sublime_session. The next time you open Sublime Text, you&#8217;ll be greeted by a blank window that doesn&#8217;t crash.",
            "content_html": "<p>Let&#8217;s say you accidentally opened an entire directory or a file that makes Sublime Text crash or hang. No big deal, just force quit, right? There&#8217;s one small problem — unless you explicitly turned it off, Sublime wants to be helpful and open the last files you were working on. So you might find yourself in a situation where the app crashes or hangs every time you to try to open it.</p><p>You&#8217;ve probably tried restarting the application, restarting your computer, and even reinstalling the app to no avail. Fortunately this is an easy fix. On your Mac, all you have to do is navigate to <code class=\"highlighter-rouge\">Library/Application Support/Sublime Text 3/Local</code> and delete <code class=\"highlighter-rouge\">Session.sublime_session</code>. The next time you open Sublime Text, you&#8217;ll be greeted by a blank window that doesn&#8217;t crash.</p>",
            "url": "https://perrera.com/2014/help-sublime-text-forget-last-open-files/",
            
            
            
            
            
            "date_published": "2014-11-30T00:00:00+00:00",
            "date_modified": "2014-11-30T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2014/tech-palette-how-to/",
            "title": "Tech Palette How-to",
            "summary": null,
            "content_text": "I’ve searched high and low for a monitor raiser that would do two things: bring my Apple Thunderbolt Display up to a more natural eye-level and free up some desk space by tucking my Mac Mini underneath it.Since I couldn’t find anything that fit the bill, I decided to design and build my own. I call it a ‘tech palette’ because it resembles a tiny shipping palette. Here, I’ll show you how to build one for yourself in about an hour.Supplies  One .75” x 1.5” x 6’ Pine Board  A saw and mitre box  Wood glue  220 Grit sandpaperStepsMeasureOn your pine board, measure out two 9” lengths and four 10” lengths. You should have about 14” of wood left over.CutSecure the board in your mitre box and make your cuts on your measured lines. Then smooth down the freshly cut edge with sandpaper.GlueYou’ll have to apply wood glue to both surfaces of each contact area. To ensure the joins are as clean as possible, you should mark off each area where you’ll need to apply the glue. On the narrow side of each 9” board, mark four 1.5” areas that are 1” apart. On the broadside of each 10” board, mark off .75” on each side.Mockup the pieces of your tech palette so that the edges are flush and easy to set in place. One board at a time, apply and spread a small amount of wood glue to each marked area and set it in place, making sure all of the joins are flush.Give the glue about five minutes to start to set then wipe away any excess with a damp cloth. Don’t wait too long to do this or the glue will be difficult to remove. Finally, place a heavy book on top of the palette overnight to ensure a strong bond.That’s it. You’ve made a tech palette.",
            "content_html": "<p><img src=\"/assets/tech-palette-front.jpg\" alt=\"Tech Palette\" /></p><p>I’ve searched high and low for a monitor raiser that would do two things: bring my Apple Thunderbolt Display up to a more natural eye-level and free up some desk space by tucking my Mac Mini underneath it.</p><p>Since I couldn’t find anything that fit the bill, I decided to design and build my own. I call it a ‘tech palette’ because it resembles a tiny shipping palette. Here, I’ll show you how to build one for yourself in about an hour.</p><h2 id=\"supplies\">Supplies</h2><ul>  <li>One .75” x 1.5” x 6’ Pine Board</li>  <li><a href=\"http://www.amazon.com/gp/product/B00002X232/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00002X232&amp;linkCode=as2&amp;tag=perreracom0a-20&amp;linkId=WYCCLRNRVEKAHKZA\">A saw and mitre box</a></li>  <li><a href=\"http://www.amazon.com/gp/product/B0045PXPH6/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B0045PXPH6&amp;linkCode=as2&amp;tag=perreracom0a-20&amp;linkId=G25KV5OXOKV37H2I\">Wood glue</a></li>  <li><a href=\"http://www.amazon.com/gp/product/B000BQRFDS/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B000BQRFDS&amp;linkCode=as2&amp;tag=perreracom0a-20&amp;linkId=X5OE4Q3QPSQC7DTX\">220 Grit sandpaper</a></li></ul><h2 id=\"steps\">Steps</h2><p><img src=\"/assets/tech-palette.svg\" alt=\"Tech Palette Schematics\" /></p><h3 id=\"measure\">Measure</h3><p>On your pine board, measure out two 9” lengths and four 10” lengths. You should have about 14” of wood left over.</p><h3 id=\"cut\">Cut</h3><p>Secure the board in your mitre box and make your cuts on your measured lines. Then smooth down the freshly cut edge with sandpaper.</p><h3 id=\"glue\">Glue</h3><p>You’ll have to apply wood glue to both surfaces of each contact area. To ensure the joins are as clean as possible, you should mark off each area where you’ll need to apply the glue. On the narrow side of each 9” board, mark four 1.5” areas that are 1” apart. On the broadside of each 10” board, mark off .75” on each side.</p><p>Mockup the pieces of your tech palette so that the edges are flush and easy to set in place. One board at a time, apply and spread a small amount of wood glue to each marked area and set it in place, making sure all of the joins are flush.</p><p>Give the glue about five minutes to start to set then wipe away any excess with a damp cloth. Don’t wait too long to do this or the glue will be difficult to remove. Finally, place a heavy book on top of the palette overnight to ensure a strong bond.</p><p><img src=\"/assets/tech-palette-side.jpg\" alt=\"\" /></p><p>That’s it. You’ve made a tech palette.</p>",
            "url": "https://perrera.com/2014/tech-palette-how-to/",
            
            
            
            
            
            "date_published": "2014-09-21T00:00:00+00:00",
            "date_modified": "2014-09-21T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2014/leaving-the-outfit/",
            "title": "Leaving The Outfit",
            "summary": null,
            "content_text": "Today I’d like to announce that I’ve left The Outfit, a company that I co-founded more than two years ago. I learned a lot, grew professionally, worked with great clients and skilled craftspeople — but now it’s time for a change. I’d like to say thank you to my former business partners for allowing me to come along for the ride.What’s next? I’m not exactly sure, but I don’t think I’ll be able to stay idle for long. If you have an interesting problem that needs solving, don’t be afraid to get in touch.",
            "content_html": "<p>Today I’d like to announce that I’ve left The Outfit, a company that I co-founded more than two years ago. I learned a lot, grew professionally, worked with great clients and skilled craftspeople — but now it’s time for a change. I’d like to say thank you to my former business partners for allowing me to come along for the ride.</p><p>What’s next? I’m not exactly sure, but I don’t think I’ll be able to stay idle for long. If you have an interesting problem that needs solving, don’t be afraid to <a href=\"mailto:dan@perrera.com\">get in touch</a>.</p>",
            "url": "https://perrera.com/2014/leaving-the-outfit/",
            
            
            
            
            
            "date_published": "2014-09-15T00:00:00+00:00",
            "date_modified": "2014-09-15T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2014/what-killed-editorially/",
            "title": "What Killed Editorially?",
            "summary": null,
            "content_text": "On February 12, 2014 the very talented team at Editorially, a web-based collaborative writing app, announced that they would be closing their doors.As someone whose team has been hard at work on our own product, I can only imagine how heartbreaking it is for the Editorially team to pack up and go home after having spent a considerable amount of time creating a very useful tool that could have been widely adopted.Since I have absolutely zero knowledge of the inner workings of their company, the best I can do is speculate. Perhaps by examining the possible factors that contributed to Editorially&#8217;s demise, we can glean some insight on how we might make products that can stand the test of time.As a part of their announcement, Editorially published an extensive and apologetic FAQ. The last two answers really stood out to me:  Why not just charge for use?We thought of that, and in fact, it was always our plan to do so. But Editorially is a sophisticated application that requires a team of engineers to maintain and develop. Even if all of our users paid up, it wouldn’t be enough.  Why not Kickstart it or open source it or or or&#8230;?We’ve considered every possible avenue to keep things going, but none of them add up. We do not take this decision lightly, but we believe the best thing we can do for our users is to close down as gracefully as we can. We’re very, very sorry.Before we dive deeper, let&#8217;s recap what we know about Editorially from the outside:  They were backed by an undisclosed amount of venture capital.  There were four well-known founders plus an additional seven employees — a team of eleven in total.  The Editorially team ran STET, a beautifully designed and edited web publication.  The product was in &#8220;beta&#8221; for over a year.  No pricing model or business plan was ever announced.So what stopped a promising start-up from ever getting out of the gate?Suspect One: Venture CapitalDid investment force the company to prioritize growth too early?There aren&#8217;t enough kind words to say about the work that was accomplished – the interface was gorgeous, the marketing was compelling, and the app functioned well – but maybe an influx of cash caused the team to grow at a rate that didn&#8217;t make sense for the business. It feels like the priority was to massively grow the user base before monetizing the product.For example, they put an intensive amount of time and effort into STET in what seemed like an attempt to attract users. That&#8217;s not necessarily a bad marketing tactic, but it&#8217;s an expensive (and distracting) gamble, especially if you haven&#8217;t started generating revenue yet.It&#8217;s also possible that the investors felt like they wouldn&#8217;t see a return on their investment in a reasonable amount of time.Suspect Two: Adoption HabitsCan you expect people to change their workflow for a product that&#8217;s in beta?You can assume that if someone is in the market for a collaborative writing tool, writing – in one way or another – is a part of their job. No matter how user-friendly an application is, changing the infrastructure for how people accomplish their work is painful, not to mention the extra friction of convincing collaborators to learn to use a new tool as well.I think it&#8217;s safe to say that a year is an unfairly short period of time for teams doing serious work to change the way they&#8217;ve been sharing and collaborating on their writing.Suspect Three: Lack of a Price TagHow can you expect pro users to invest their time in your product when they don&#8217;t know how much it will cost?Personally, I was put off for a long time by the lack of a price tag. There&#8217;s an inherent risk of investing time into a new workflow when it might turn out to be too expensive.We all know there&#8217;s no such thing as a free ride. It&#8217;s not out of the realm of possibility that some potential users were waiting for Editorially to announce their plans before diving in. It seems premature to pull the plug before letting customers know that you&#8217;re a serious business and finding out how large that base could really be.Does it matter in the end?It&#8217;s likely that it wasn&#8217;t any single suspect that led to the untimely death of Editorially, but they probably all played a part. The fact is that start-ups just aren&#8217;t being built for a slow and steady ascent to success. If you&#8217;re a customer, that&#8217;s worth considering before you invest in a free product. And if you&#8217;re a product developer and have an idea you care about, the same fact is worth considering before you take money from investors.Where to from hereFortunately, as Editorially is going through the shut down process, they tweeted about Draft which is where I&#8217;ll be moving my collaborative documents. Importing a zip file of my Editorially documents was painless and, after kicking the tires a bit, I decided to support the developer with a yearly subscription. I encourage you to do the same. As a consumer, voting with your wallet is the best way to ensure that the tools you love stay around for the long haul.",
            "content_html": "<p>On February 12, 2014 the very talented team at Editorially, a web-based collaborative writing app, <a href=\"http://stet.editorially.com/articles/goodbye/\">announced</a> that they would be closing their doors.</p><p>As someone whose team has been hard at work on <a href=\"http://bigboard.us\">our own product</a>, I can only imagine how heartbreaking it is for the Editorially team to pack up and go home after having spent a considerable amount of time creating a very useful tool that could have been widely adopted.</p><p>Since I have absolutely zero knowledge of the inner workings of their company, the best I can do is speculate. Perhaps by examining the possible factors that contributed to Editorially&#8217;s demise, we can glean some insight on how we might make products that can stand the test of time.</p><p>As a part of their announcement, Editorially published an extensive and apologetic FAQ. The last two answers really stood out to me:</p><blockquote>  <p><strong>Why not just charge for use?</strong>We thought of that, and in fact, it was always our plan to do so. But Editorially is a sophisticated application that requires a team of engineers to maintain and develop. Even if all of our users paid up, it wouldn’t be enough.</p>  <p><strong>Why not Kickstart it or open source it or or or&#8230;?</strong>We’ve considered every possible avenue to keep things going, but none of them add up. We do not take this decision lightly, but we believe the best thing we can do for our users is to close down as gracefully as we can. We’re very, very sorry.</p></blockquote><p>Before we dive deeper, let&#8217;s recap what we know about Editorially from the outside:</p><ul>  <li>They were backed by an undisclosed amount of <a href=\"http://www.crunchbase.com/company/editorially\">venture capital</a>.</li>  <li>There were four well-known founders plus an additional seven employees — a team of eleven in total.</li>  <li>The Editorially team ran <a href=\"http://stet.editorially.com/\"><em>STET</em></a>, a beautifully designed and edited web publication.</li>  <li>The product was in &#8220;beta&#8221; for over a year.</li>  <li>No pricing model or business plan was ever announced.</li></ul><p>So what stopped a promising start-up from ever getting out of the gate?</p><h2 id=\"suspect-one-venture-capital\">Suspect One: Venture Capital</h2><p><em>Did investment force the company to prioritize growth too early?</em></p><p>There aren&#8217;t enough kind words to say about the work that was accomplished – the interface was gorgeous, the marketing was compelling, and the app functioned well – but maybe an influx of cash caused the team to grow at a rate that didn&#8217;t make sense for the business. It feels like the priority was to massively grow the user base before monetizing the product.</p><p>For example, they put an intensive amount of time and effort into <em>STET</em> in what seemed like an attempt to attract users. That&#8217;s not necessarily a bad marketing tactic, but it&#8217;s an expensive (and distracting) gamble, especially if you haven&#8217;t started generating revenue yet.</p><p>It&#8217;s also possible that the investors felt like they wouldn&#8217;t see a return on their investment in a reasonable amount of time.</p><h2 id=\"suspect-two-adoption-habits\">Suspect Two: Adoption Habits</h2><p><em>Can you expect people to change their workflow for a product that&#8217;s in beta?</em></p><p>You can assume that if someone is in the market for a collaborative writing tool, writing – in one way or another – is a part of their job. No matter how user-friendly an application is, changing the infrastructure for how people accomplish their work is painful, not to mention the extra friction of convincing collaborators to learn to use a new tool as well.</p><p>I think it&#8217;s safe to say that a year is an unfairly short period of time for teams doing serious work to change the way they&#8217;ve been sharing and collaborating on their writing.</p><h2 id=\"suspect-three-lack-of-a-price-tag\">Suspect Three: Lack of a Price Tag</h2><p><em>How can you expect pro users to invest their time in your product when they don&#8217;t know how much it will cost?</em></p><p>Personally, I was put off for a long time by the lack of a price tag. There&#8217;s an inherent risk of investing time into a new workflow when it might turn out to be too expensive.</p><p>We all know there&#8217;s no such thing as a free ride. It&#8217;s not out of the realm of possibility that some potential users were waiting for Editorially to announce their plans before diving in. It seems premature to pull the plug before letting customers know that you&#8217;re a serious business and finding out how large that base could really be.</p><h2 id=\"does-it-matter-in-the-end\">Does it matter in the end?</h2><p>It&#8217;s likely that it wasn&#8217;t any single suspect that led to the untimely death of Editorially, but they probably all played a part. The fact is that start-ups just aren&#8217;t being built for a slow and steady ascent to success. If you&#8217;re a customer, that&#8217;s worth considering before you invest in a free product. And if you&#8217;re a product developer and have an idea you care about, the same fact is worth considering before you take money from investors.</p><h2 id=\"where-to-from-here\">Where to from here</h2><p>Fortunately, as Editorially is going through the shut down process, they tweeted about <a href=\"https://draftin.com\">Draft</a> which is where I&#8217;ll be moving my collaborative documents. Importing a zip file of my Editorially documents was painless and, after kicking the tires a bit, I decided to support the developer with a yearly subscription. I encourage you to do the same. As a consumer, voting with your wallet is the best way to ensure that the tools you love stay around for the long haul.</p>",
            "url": "https://perrera.com/2014/what-killed-editorially/",
            
            
            
            
            
            "date_published": "2014-02-18T00:00:00+00:00",
            "date_modified": "2014-02-18T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2013/2013-recap/",
            "title": "2013 Recap",
            "summary": null,
            "content_text": "For me, 2013 felt like the middle part of a trilogy. It was long and nothing particularly exciting happened but it laid the groundwork for the next part of the story.The OutfitAt The Outfit, we entered into our second year of business. In February, Brenden joined us as our sixth partner and we moved to our new Boston office over the summer.BigBoard ComethWe dedicated a large portion of our year to building BigBoard which will be out in 2014. The whole team worked really hard to make an amazing product. I&#8217;m so proud that we&#8217;ve been able to fund this venture ourselves and realize an idea that will surely be useful to a lot of people. I can&#8217;t wait to see how people use it and find out what we got right and, more importantly, what we got wrong.Getting to BusinessI&#8217;ve always been interested in business and now, with The Outfit in full swing, I feel like I owe it to myself and my business partners to educate myself more deeply in this art. I read The Personal MBA, kept listening to The Critical Path, and added the Harvard Business Review&#8217;s blogs to my RSS reader. These resources have been extremely helpful and have added even more material to my reading list.Programming with PythonAs I wrote in Learning Hurdles, I&#8217;ve finally gotten my head around Python, my first grown-up programming language. Its been frustrating, fulfilling, and fun – I guess that&#8217;s what learning feels like.For 2014My plan is to work on sharing more about what I learn here, even if I feel like it may be a bit elementary. I think 2014 will find me learning a lot more about marketing campaigns, measuring results and iterating more than I ever have before.Whatever happens, I&#8217;m sure it&#8217;ll be exciting.",
            "content_html": "<p>For me, 2013 felt like the middle part of a trilogy. It was long and nothing particularly exciting happened but it laid the groundwork for the next part of the story.</p><h2 id=\"the-outfit\">The Outfit</h2><p>At <a href=\"http://fromtheoutfit.com\">The Outfit</a>, we entered into our second year of business. In February, <a href=\"https://twitter.com/btamilio\">Brenden</a> joined us as our sixth partner and we moved to our new Boston office over the summer.</p><h2 id=\"bigboard-cometh\">BigBoard Cometh</h2><p>We dedicated a large portion of our year to building <a href=\"http://bigboard.us\">BigBoard</a> which will be out in 2014. The whole team worked really hard to make an amazing product. I&#8217;m so proud that we&#8217;ve been able to fund this venture ourselves and realize an idea that will surely be useful to a lot of people. I can&#8217;t wait to see how people use it and find out what we got right and, more importantly, what we got wrong.</p><h2 id=\"getting-to-business\">Getting to Business</h2><p>I&#8217;ve always been interested in business and now, with The Outfit in full swing, I feel like I owe it to myself and my business partners to educate myself more deeply in this art. I read <a href=\"https://itunes.apple.com/us/book/the-personal-mba/id386084108?mt=11&amp;uo=4&amp;at=11lqt7\">The Personal MBA</a>, kept listening to <a href=\"http://5by5.tv/criticalpath\">The Critical Path</a>, and added the <a href=\"http://blogs.hbr.org\">Harvard Business Review&#8217;s blogs</a> to my RSS reader. These resources have been extremely helpful and have added even more material to my reading list.</p><h2 id=\"programming-with-python\">Programming with Python</h2><p>As I wrote in <a href=\"http://perrera.com/blog/learning-hurdles\">Learning Hurdles</a>, I&#8217;ve finally gotten my head around <a href=\"http://www.python.org\">Python</a>, my first grown-up programming language. Its been frustrating, fulfilling, and fun – I guess that&#8217;s what learning feels like.</p><h2 id=\"for-2014\">For 2014</h2><p>My plan is to work on sharing more about what I learn here, even if I feel like it may be a bit elementary. I think 2014 will find me learning a lot more about marketing campaigns, measuring results and iterating more than I ever have before.</p><p>Whatever happens, I&#8217;m sure it&#8217;ll be exciting.</p>",
            "url": "https://perrera.com/2013/2013-recap/",
            
            
            
            
            
            "date_published": "2013-12-30T00:00:00+00:00",
            "date_modified": "2013-12-30T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2013/learning-hurdles/",
            "title": "Learning Hurdles",
            "summary": null,
            "content_text": "I&#8217;ve been playing around with all sorts of programming languages for the past couple of years but hadn&#8217;t committed to any of them. I understood programming in principle but couldn&#8217;t find it in myself to dig in. I&#8217;m not exactly sure what happened but, a couple of months ago, I finally chose a language to focus on: Python.Even though I didn&#8217;t know a single person who could help me, I dug in. I read Real Python then Real Python for the Web. And while I&#8217;m just getting started with these tools, I&#8217;m over my learning hurdle and starting to make some things that are pretty decent.I suspect learning hurdles are unique for each person however, I&#8217;d bet that they all stem from the same place. Feeling like you don&#8217;t know what you&#8217;re doing is very unsettling. You might feel dumb for a while, but don&#8217;t let that hold you back.Here&#8217;s the secret: get comfortable with the idea of being embarrassingly bad at what you&#8217;re trying to learn, but set a goal and get it done. Don&#8217;t worry about the elegance of your work — not yet — just get it done. You&#8217;ll get good enough to know that you can do it better, then go ahead and figure that out. Before you know it, you&#8217;ll know what you&#8217;re doing and it&#8217;ll feel really good.",
            "content_html": "<p>I&#8217;ve been playing around with all sorts of programming languages for the past couple of years but hadn&#8217;t committed to any of them. I understood programming in principle but couldn&#8217;t find it in myself to dig in. I&#8217;m not exactly sure what happened but, a couple of months ago, I finally chose a language to focus on: <a href=\"http://www.python.org\">Python</a>.</p><p>Even though I didn&#8217;t know a single person who could help me, I dug in. I read <a href=\"http://www.realpython.com\"><em>Real Python</em></a> then <em>Real Python for the Web.</em> And while I&#8217;m just getting started with these tools, I&#8217;m over my learning hurdle and starting to make some things that are pretty decent.</p><p>I suspect learning hurdles are unique for each person however, I&#8217;d bet that they all stem from the same place. Feeling like you don&#8217;t know what you&#8217;re doing is very unsettling. You might feel dumb for a while, but don&#8217;t let that hold you back.</p><p>Here&#8217;s the secret: get comfortable with the idea of being embarrassingly bad at what you&#8217;re trying to learn, but set a goal and get it done. Don&#8217;t worry about the elegance of your work — not yet — just get it done. You&#8217;ll get good enough to know that you can do it better, then go ahead and figure that out. Before you know it, you&#8217;ll know what you&#8217;re doing and it&#8217;ll feel really good.</p>",
            "url": "https://perrera.com/2013/learning-hurdles/",
            
            
            
            
            
            "date_published": "2013-12-01T00:00:00+00:00",
            "date_modified": "2013-12-01T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2013/getting-crafty/",
            "title": "Getting Crafty",
            "summary": null,
            "content_text": "It&#8217;s been a busy half year, not only for me and my team at The Outfit, but in the content management world as well. Recently I put Statamic through its paces and, while it&#8217;s definitely worth a look, now it&#8217;s Craft&#8217;s turn with it&#8217;s recently released 1.0 version.Initial impressionsI like Craft a lot. The Pixel &amp; Tonic team has taken the opportunity of a clean slate to make an unburdened and modern content management system. It comes with features out of the box that make it powerful enough for developers to love, but with a simple yet feature-packed control panel to make clients swoon. They probably won&#8217;t swoon, but they should. Here are my favorite bits:Business ModelThe base of Craft is free, which is plenty for you to get a sense of what the software can do. Need more features? Pay only for what you need. This freemium model was a wise move to boost developer adoption – it worked on me. Upgrades for multiple content sections, users and more are individual &#8220;packages&#8221; which can be activated from the Craft control panel.One Click UpdatingI don&#8217;t understand why this feature is so hard to come by. When I heard that Craft had it, my heart fluttered. For me, giving a client (or myself) the ability to keep their CMS up-to-date is key. Up-to-date sites are more secure for the client and make it easier for developers to pick up old projects with confidence.Live PreviewThere hasn&#8217;t been a project I&#8217;ve worked on where this question doesn&#8217;t pop up: &#8220;How do I preview my page before it goes live?&#8221; And it always breaks my heart to say: &#8220;Well it&#8217;s possible, but it&#8217;s going to take more time and money.&#8221;This is one of those features that is typically underrated by developers and adored and/or expected by clients who are not as confident about web publishing. Craft&#8217;s implementation of Live Preview is incredibly elegant and beautifully executed.Control PanelIt&#8217;s customizable, responsive and beautifully designed. There&#8217;s very little to learn and it&#8217;s eminently approachable. I know that this is sounding a little gushy at this point but, hey, credit where credit is due.Glorious Field Types!Craft comes with a bundle of field types to help you make a great CMS experience for your client. Each field type is like a tool in your toolbox and they&#8217;re fairly intuitive to use.Twig for TemplatingCraft uses Twig to handle templating which is by far the biggest learning curve I experienced while getting to know the CMS. I&#8217;ve only scratched the surface of Twig but the power is obvious. The slide out panel on this blog for example, which requires a custom plugin in Statamic or ExpressionEngine, is achievable in Twig with no extra plugins.Early daysThe only drawback that I can see at the moment is the lack of a robust library of plugins. Straight up Craft is off to a decent start but it&#8217;s hardly comprehensive&#8230; for now.Where to startWhile the docs are well organized and definitely helpful, I found Mijingo&#8217;s tutorial videos very helpful to get started. We&#8217;re spoiled rotten with good CMS choices these days but Craft is definitely worth a shot.",
            "content_html": "<p>It&#8217;s been a busy half year, not only for me and my team at <a href=\"http://fromtheoutfit.com\">The Outfit</a>, but in the content management world as well. Recently I put <a href=\"http://statamic.com\">Statamic</a> through its paces and, while it&#8217;s definitely worth a look, now it&#8217;s <a href=\"http://buildwithcraft.com\">Craft&#8217;s</a> turn with it&#8217;s recently released 1.0 version.</p><h2 id=\"initial-impressions\">Initial impressions</h2><p>I like Craft a lot. The <a href=\"http://pixelandtonic.com/\">Pixel &amp; Tonic</a> team has taken the opportunity of a clean slate to make an unburdened and modern content management system. It comes with features out of the box that make it powerful enough for developers to love, but with a simple yet feature-packed control panel to make clients swoon. They probably won&#8217;t swoon, but they should. Here are my favorite bits:</p><h3 id=\"business-model\">Business Model</h3><p>The base of Craft is free, which is plenty for you to get a sense of what the software can do. Need more features? Pay only for what you need. This freemium model was a wise move to boost developer adoption – it worked on me. Upgrades for multiple content sections, users and more are individual &#8220;packages&#8221; which can be activated from the Craft control panel.</p><h3 id=\"one-click-updating\">One Click Updating</h3><p>I don&#8217;t understand why this feature is so hard to come by. When I heard that Craft had it, my heart fluttered. For me, giving a client (or myself) the ability to keep their CMS up-to-date is key. Up-to-date sites are more secure for the client and make it easier for developers to pick up old projects with confidence.</p><h3 id=\"live-preview\">Live Preview</h3><p>There hasn&#8217;t been a project I&#8217;ve worked on where this question doesn&#8217;t pop up: &#8220;How do I preview my page before it goes live?&#8221; And it always breaks my heart to say: &#8220;Well it&#8217;s possible, but it&#8217;s going to take more time and money.&#8221;</p><p>This is one of those features that is typically underrated by developers and adored and/or expected by clients who are not as confident about web publishing. Craft&#8217;s implementation of Live Preview is incredibly elegant and beautifully executed.</p><h3 id=\"control-panel\">Control Panel</h3><p>It&#8217;s customizable, responsive and beautifully designed. There&#8217;s very little to learn and it&#8217;s eminently approachable. I know that this is sounding a little gushy at this point but, hey, credit where credit is due.</p><h3 id=\"glorious-field-types\">Glorious Field Types!</h3><p>Craft comes with a bundle of field types to help you make a great CMS experience for your client. Each field type is like a tool in your toolbox and they&#8217;re fairly intuitive to use.</p><h3 id=\"twig-for-templating\">Twig for Templating</h3><p>Craft uses <a href=\"http://twig.sensiolabs.org\">Twig</a> to handle templating which is by far the biggest learning curve I experienced while getting to know the CMS. I&#8217;ve only scratched the surface of Twig but the power is obvious. The slide out panel on this blog for example, which requires a custom plugin in Statamic or ExpressionEngine, is achievable in Twig with no extra plugins.</p><h2 id=\"early-days\">Early days</h2><p>The only drawback that I can see at the moment is the lack of a robust library of plugins. <a href=\"http://straightupcraft.com/craft-plugins\">Straight up Craft</a> is off to a decent start but it&#8217;s hardly comprehensive&#8230; for now.</p><h2 id=\"where-to-start\">Where to start</h2><p>While the docs are well organized and definitely helpful, I found <a href=\"http://mijingo.com/products/screencasts/craft-cms-tutorial/\">Mijingo&#8217;s tutorial videos</a> very helpful to get started. We&#8217;re spoiled rotten with good CMS choices these days but Craft is definitely worth a shot.</p>",
            "url": "https://perrera.com/2013/getting-crafty/",
            
            
            
            
            
            "date_published": "2013-07-06T00:00:00+00:00",
            "date_modified": "2013-07-06T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2012/2012-recap/",
            "title": "2012 Recap",
            "summary": null,
            "content_text": "A lot changed in 2012. Here are some notable highlights, roughly in order of how they happened:Good LooksIn January, Amy, my partner in both domestic and business capacities, decided she was ready to start writing about style and fashion, subjects which she has developed quite a passion for. So, like good web workers, she designed and I built Good Looks Daily for her. In April, Amy got over her fear of having her photo taken and recruited me to be her photographer. I think we&#8217;ve amassed a nice body of work over the year. It&#8217;s been inspiring to watch Amy find her voice and grow a following of other fashion focused people around the world.In May I helped release Good Looks for iPhone with Amy, who did a beautiful job of design, and Geoff Bradford, who did an outstanding job on the iOS development. I worked on the user experience and the feature set of the app, something I&#8217;d like to do more of in the future.Goodbye Height &amp; Hands, Hello The OutfitAfter a little more than a year of Height &amp; Hands, we formed The Outfit in June. The announcement had to wait until July because we were knee deep in setting up our business, getting settled in our new Boston office, and working on our first project for Evernote.Being a partner at The Outfit has been the most exhilarating professional endeavor that I&#8217;ve ever participated in. There are not enough nice words to say about my partners Amy, Johannes, Marc, and Michael. With them, work is an absolute joy and the possibilities of what we can do as a company seem endless.If the last six months are any indication, we have a bright future ahead. In fact, we already have some exciting news queued up for early 2013.Health and FitnessIn August I started a weight loss competition with some friends. Since I was about to turn 30, the time was right for me to reassess my poor dietary habits and underwhelming workout routine. With the help of MyFitnessPal on iOS, I kept a log of my calories and tracked my weight.Logging my calories was truly enlightening. Now I have a great sense of how much food is enough, what foods satisfy me, and what choices I need to make to maintain a more healthy weight. My biggest surprise was how few compromises I had to make.I started out at a hefty 219 lbs and have since come down over 25 lbs to 193. Thanks to these changes, my energy level is up, I&#8217;m more focused and efficient when I sit down to work, and my baseline mood has improved.Travel and a Big BirthdayIn September I turned 30 and to celebrate, Amy and I went on a week long cruise of Northern Europe followed by another week in London. We ate a lot of good food, drank a lot of good beer, and reconnected with one of my good friends who lives there.It was amazing, as always, to see other countries and broaden my world view. On this trip in particular, I gained a new found respect for mobile bandwidth thanks to an old iPhone 3GS and a pre-paid Vodafone sim card. I&#8217;ve since been highly aware of building mobile experiences that are efficient and fast.For 2013Personally, I still need to work on having a hobby. I&#8217;ve decided to pick  up the guitar again after many years away. Professionally, I&#8217;ve already begun to hone my JavaScript skills and plan on taking them to the next level in the coming year. And once again, I&#8217;ll remind myself to be open to change and be objective in my decisions, seeing as that worked out pretty well last year.",
            "content_html": "<p>A lot changed in 2012. Here are some notable highlights, roughly in order of how they happened:</p><h2 id=\"good-looks\">Good Looks</h2><p>In January, Amy, my partner in both domestic and business capacities, decided she was ready to start writing about style and fashion, subjects which she has developed quite a passion for. So, like good web workers, she designed and I built <a href=\"http://goodlooksdaily.com\">Good Looks Daily</a> for her. In April, Amy got over her fear of having her photo taken and recruited me to be her photographer. I think we&#8217;ve amassed a nice <a href=\"http://goodlooksdaily.com/outfits\">body of work</a> over the year. It&#8217;s been inspiring to watch Amy find her voice and grow a following of other fashion focused people around the world.</p><p>In May I helped release <a href=\"http://goodlooksapp.com\">Good Looks for iPhone</a> with <a href=\"http://goodlooksdaily.com\">Amy</a>, who did a beautiful job of design, and <a href=\"http://twitter.com/whitedonkey\">Geoff Bradford</a>, who did an outstanding job on the iOS development. I worked on the user experience and the feature set of the app, something I&#8217;d like to do more of in the future.</p><h2 id=\"goodbye-height--hands-hello-the-outfit\">Goodbye Height &amp; Hands, Hello The Outfit</h2><p>After a little more than a year of Height &amp; Hands, we formed <a href=\"http://fromtheoutfit.com\">The Outfit</a> in June. The <a href=\"/blog/introducing_the_outfit\">announcement</a> had to wait until July because we were knee deep in setting up our business, getting settled in our new Boston office, and working on our first project for <a href=\"http://trunk.evernote.com\">Evernote</a>.</p><p>Being a partner at The Outfit has been the most exhilarating professional endeavor that I&#8217;ve ever participated in. There are not enough nice words to say about my partners <a href=\"http://twitter.com/amyhparker\">Amy</a>, <a href=\"http://twitter.com/drj\">Johannes</a>, <a href=\"http://twitter.com/marcamos\">Marc</a>, and <a href=\"http://twitter.com/michaelwitwicki\">Michael</a>. With them, work is an absolute joy and the possibilities of what we can do as a company seem endless.</p><p>If the last six months are any indication, we have a bright future ahead. In fact, we already have some exciting news queued up for early 2013.</p><h2 id=\"health-and-fitness\">Health and Fitness</h2><p>In August I started a weight loss competition with some friends. Since I was about to turn 30, the time was right for me to reassess my poor dietary habits and underwhelming workout routine. With the help of <a href=\"http://www.myfitnesspal.com\">MyFitnessPal</a> on iOS, I kept a log of my calories and tracked my weight.</p><p>Logging my calories was truly enlightening. Now I have a great sense of how much food is enough, what foods satisfy me, and what choices I need to make to maintain a more healthy weight. My biggest surprise was how few compromises I had to make.</p><p>I started out at a hefty 219 lbs and have since come down over 25 lbs to 193. Thanks to these changes, my energy level is up, I&#8217;m more focused and efficient when I sit down to work, and my baseline mood has improved.</p><h2 id=\"travel-and-a-big-birthday\">Travel and a Big Birthday</h2><p>In September I turned 30 and to celebrate, Amy and I went on a week long cruise of Northern Europe followed by another week in London. We ate a lot of good food, drank a lot of good beer, and reconnected with one of my good friends who lives there.</p><p>It was amazing, as always, to see other countries and broaden my world view. On this trip in particular, I gained a new found respect for mobile bandwidth thanks to an old iPhone 3GS and a pre-paid Vodafone sim card. I&#8217;ve since been highly aware of building mobile experiences that are efficient and fast.</p><h2 id=\"for-2013\">For 2013</h2><p>Personally, I still need to work on having a hobby. I&#8217;ve decided to pick  up the guitar again after many years away. Professionally, I&#8217;ve already begun to hone my JavaScript skills and plan on taking them to the next level in the coming year. And <a href=\"/blog/2011_recap\">once again</a>, I&#8217;ll remind myself to be open to change and be objective in my decisions, seeing as that worked out pretty well last year.</p>",
            "url": "https://perrera.com/2012/2012-recap/",
            
            
            
            
            
            "date_published": "2012-12-31T00:00:00+00:00",
            "date_modified": "2012-12-31T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        },
    
        {
            "id": "https://perrera.com/2012/introducing-the-outfit/",
            "title": "Introducing The Outfit",
            "summary": null,
            "content_text": "I&#8217;m so excited to announce that my tiny design shop, Height &amp; Hands is joining forces with Boston Web Studio and Booyant, two of the best web development shops in the Boston area. Together, we are The Outfit, a full-service design and development powerhouse.The BeginningTwo years ago, when we started Height &amp; Hands, Amy and I worked from home which meant that any chance to get out of the house was a welcome event. We started frequenting Build Guild where we met, and eventually made friends with, Marc, Michael and Johannes. Shortly thereafter, we started coworking out of the BWS/Booyant office in Beverly once a month or so. We would talk shop, share tips and tricks about software and wait for Marc or Amy to spill something on themselves. Sometime this past February, we began to seriously discuss what a three-company merger would look like.One Big Happy FamilyAs H&amp;H, we could really only take on a few small projects at a time and we were a bit limited in our ability to offer a truly complete range of services. Once we started talking with the other guys, we realized that their hardcore development skills were the perfect compliment to our design expertise. Bringing everything together under one roof would allow us to tackle bigger projects, focus on our individual strengths and work as an integrated team.I consider myself lucky to have found such extremely talented and high character people who have similar approaches to business, work and life.The FutureTogether, we comprise a team with a broad and deep skill-set that are obsessive about working together to make each project as great as possible. We&#8217;re already working on some amazing new projects and are continuing to develop products of our own. I couldn&#8217;t be more excited.To learn more about The Outfit, check out our website and be sure to follow us on Twitter.UpdateAs of September 2014, I&#8217;ve left The Outfit and have started a new studio called Fore Design.",
            "content_html": "<p>I&#8217;m so excited to announce that my tiny design shop, <a href=\"http://heightandhands.com\">Height &amp; Hands</a> is joining forces with <a href=\"http://bostonwebstudio.com\">Boston Web Studio</a> and <a href=\"http://booyant.com\">Booyant</a>, two of the best web development shops in the Boston area. Together, we are <a href=\"http://fromtheoutfit.com\">The Outfit</a>, a full-service design and development powerhouse.</p><h2 id=\"the-beginning\">The Beginning</h2><p>Two years ago, when we started Height &amp; Hands, Amy and I worked from home which meant that any chance to get out of the house was a welcome event. We started frequenting <a href=\"http://salem.buildguild.org/\">Build Guild</a> where we met, and eventually made friends with, Marc, Michael and Johannes. Shortly thereafter, we started coworking out of the BWS/Booyant office in Beverly once a month or so. We would talk shop, share tips and tricks about software and wait for Marc or Amy to spill something on themselves. Sometime this past February, we began to seriously discuss what a three-company merger would look like.</p><h2 id=\"one-big-happy-family\">One Big Happy Family</h2><p>As H&amp;H, we could really only take on a few small projects at a time and we were a bit limited in our ability to offer a truly complete range of services. Once we started talking with the other guys, we realized that their hardcore development skills were the perfect compliment to our design expertise. Bringing everything together under one roof would allow us to tackle bigger projects, focus on our individual strengths and work as an integrated team.</p><p>I consider myself lucky to have found such extremely talented and high character people who have similar approaches to business, work and life.</p><h2 id=\"the-future\">The Future</h2><p>Together, we comprise a team with a broad and deep skill-set that are obsessive about working together to make each project as great as possible. We&#8217;re already working on some amazing new projects and are continuing to develop <a href=\"http://goodlooksapp.com\">products</a> of <a href=\"http://devot-ee.com/add-ons/navee\">our</a> <a href=\"http://devot-ee.com/add-ons/better-pages\">own</a>. I couldn&#8217;t be more excited.</p><p>To learn more about The Outfit, check out our <a href=\"http://fromtheoutfit.com\">website</a> and be sure to <a href=\"http://twitter.com/fromtheoutfit\">follow us on Twitter</a>.</p><h2 id=\"update\">Update</h2><p>As of September 2014, I&#8217;ve <a href=\"/blog/leaving-the-outfit\">left The Outfit</a> and have started a new studio called <a href=\"http://foredesign.co\">Fore Design</a>.</p>",
            "url": "https://perrera.com/2012/introducing-the-outfit/",
            
            
            
            
            
            "date_published": "2012-07-04T00:00:00+00:00",
            "date_modified": "2012-07-04T00:00:00+00:00",
            "author": {
                "name": "Dan Perrera"
            }
        }
    
    ]
}